/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_ADC_SR_OVRE7_MASK                            0x00008000
#define AVR32_ADC_SR_OVRE7_OFFSET                                  15
#define AVR32_ADC_SR_OVRE7_SIZE                                     1
#define AVR32_ADC_SR_RXBUFF                                        19
#define AVR32_ADC_SR_RXBUFF_MASK                           0x00080000
#define AVR32_ADC_SR_RXBUFF_OFFSET                                 19
#define AVR32_ADC_SR_RXBUFF_SIZE                                    1
#define AVR32_ADC_START                                             1
#define AVR32_ADC_STARTUP                                          16
#define AVR32_ADC_STARTUP_MASK                             0x007f0000
#define AVR32_ADC_STARTUP_OFFSET                                   16
#define AVR32_ADC_STARTUP_SIZE                                      7
#define AVR32_ADC_START_MASK                               0x00000002
#define AVR32_ADC_START_OFFSET                                      1
#define AVR32_ADC_START_SIZE                                        1
#define AVR32_ADC_SWRST                                             0
#define AVR32_ADC_SWRST_MASK                               0x00000001
#define AVR32_ADC_SWRST_OFFSET                                      0
#define AVR32_ADC_SWRST_SIZE                                        1
#define AVR32_ADC_TRGEN                                             0
#define AVR32_ADC_TRGEN_MASK                               0x00000001
#define AVR32_ADC_TRGEN_OFFSET                                      0
#define AVR32_ADC_TRGEN_SIZE                                        1
#define AVR32_ADC_TRGSEL                                            1
#define AVR32_ADC_TRGSEL_MASK                              0x0000000e
#define AVR32_ADC_TRGSEL_OFFSET                                     1
#define AVR32_ADC_TRGSEL_SIZE                                       3
#define AVR32_ADC_VARIANT                                          16
#define AVR32_ADC_VARIANT_MASK                             0x00070000
#define AVR32_ADC_VARIANT_OFFSET                                   16
#define AVR32_ADC_VARIANT_SIZE                                      3
#define AVR32_ADC_VERSION                                  0x000000fc
#define AVR32_ADC_VERSION_MASK                             0x00000fff
#define AVR32_ADC_VERSION_OFFSET                                    0
#define AVR32_ADC_VERSION_SIZE                                     12
#define AVR32_ADC_VERSION_VARIANT                                  16
#define AVR32_ADC_VERSION_VARIANT_MASK                     0x00070000
#define AVR32_ADC_VERSION_VARIANT_OFFSET                           16
#define AVR32_ADC_VERSION_VARIANT_SIZE                              3
#define AVR32_ADC_VERSION_VERSION                                   0
#define AVR32_ADC_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_ADC_VERSION_VERSION_OFFSET                            0
#define AVR32_ADC_VERSION_VERSION_SIZE                             12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_adc_cr_t {
    unsigned int                 :30;
    unsigned int start           : 1;
    unsigned int swrst           : 1;
} avr32_adc_cr_t;



typedef struct avr32_adc_mr_t {
    unsigned int                 : 4;
    unsigned int shtim           : 4;
    unsigned int                 : 1;
    unsigned int startup         : 7;
    unsigned int prescal         : 8;
    unsigned int                 : 2;
    unsigned int sleep           : 1;
    unsigned int lowres          : 1;
    unsigned int trgsel          : 3;
    unsigned int trgen           : 1;
} avr32_adc_mr_t;



typedef struct avr32_adc_cher_t {
    unsigned int                 :24;
    unsigned int ch7             : 1;
    unsigned int ch6             : 1;
    unsigned int ch5             : 1;
    unsigned int ch4             : 1;
    unsigned int ch3             : 1;
    unsigned int ch2             : 1;
    unsigned int ch1             : 1;
    unsigned int ch0             : 1;
} avr32_adc_cher_t;



typedef struct avr32_adc_chdr_t {
    unsigned int                 :24;
    unsigned int ch7             : 1;
    unsigned int ch6             : 1;
    unsigned int ch5             : 1;
    unsigned int ch4             : 1;
    unsigned int ch3             : 1;
    unsigned int ch2             : 1;
    unsigned int ch1             : 1;
    unsigned int ch0             : 1;
} avr32_adc_chdr_t;



typedef struct avr32_adc_chsr_t {
    unsigned int                 :24;
    unsigned int ch7             : 1;
    unsigned int ch6             : 1;
    unsigned int ch5             : 1;
    unsigned int ch4             : 1;
    unsigned int ch3             : 1;
    unsigned int ch2             : 1;
    unsigned int ch1             : 1;
    unsigned int ch0             : 1;
} avr32_adc_chsr_t;



typedef struct avr32_adc_sr_t {
    unsigned int                 :12;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int govre           : 1;
    unsigned int drdy            : 1;
    unsigned int ovre7           : 1;
    unsigned int ovre6           : 1;
    unsigned int ovre5           : 1;
    unsigned int ovre4           : 1;
    unsigned int ovre3           : 1;
    unsigned int ovre2           : 1;
    unsigned int ovre1           : 1;
    unsigned int ovre0           : 1;
    unsigned int eoc7            : 1;
    unsigned int eoc6            : 1;
    unsigned int eoc5            : 1;
    unsigned int eoc4            : 1;
    unsigned int eoc3            : 1;
    unsigned int eoc2            : 1;
    unsigned int eoc1            : 1;
    unsigned int eoc0            : 1;
} avr32_adc_sr_t;



typedef struct avr32_adc_lcdr_t {
    unsigned int                 :22;
    unsigned int ldata           :10;
} avr32_adc_lcdr_t;



typedef struct avr32_adc_ier_t {
    unsigned int                 :12;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int govre           : 1;
    unsigned int drdy            : 1;
    unsigned int ovre7           : 1;
    unsigned int ovre6           : 1;
    unsigned int ovre5           : 1;
    unsigned int ovre4           : 1;
    unsigned int ovre3           : 1;
    unsigned int ovre2           : 1;
    unsigned int ovre1           : 1;
    unsigned int ovre0           : 1;
    unsigned int eoc7            : 1;
    unsigned int eoc6            : 1;
    unsigned int eoc5            : 1;
    unsigned int eoc4            : 1;
    unsigned int eoc3            : 1;
    unsigned int eoc2            : 1;
    unsigned int eoc1            : 1;
    unsigned int eoc0            : 1;
} avr32_adc_ier_t;



typedef struct avr32_adc_idr_t {
    unsigned int                 :12;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int govre           : 1;
    unsigned int drdy            : 1;
    unsigned int ovre7           : 1;
    unsigned int ovre6           : 1;
    unsigned int ovre5           : 1;
    unsigned int ovre4           : 1;
    unsigned int ovre3           : 1;
    unsigned int ovre2           : 1;
    unsigned int ovre1           : 1;
    unsigned int ovre0           : 1;
    unsigned int eoc7            : 1;
    unsigned int eoc6            : 1;
    unsigned int eoc5            : 1;
    unsigned int eoc4            : 1;
    unsigned int eoc3            : 1;
    unsigned int eoc2            : 1;
    unsigned int eoc1            : 1;
    unsigned int eoc0            : 1;
} avr32_adc_idr_t;



typedef struct avr32_adc_imr_t {
    unsigned int                 :12;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int govre           : 1;
    unsigned int drdy            : 1;
    unsigned int ovre7           : 1;
    unsigned int ovre6           : 1;
    unsigned int ovre5           : 1;
    unsigned int ovre4           : 1;
    unsigned int ovre3           : 1;
    unsigned int ovre2           : 1;
    unsigned int ovre1           : 1;
    unsigned int ovre0           : 1;
    unsigned int eoc7            : 1;
    unsigned int eoc6            : 1;
    unsigned int eoc5            : 1;
    unsigned int eoc4            : 1;
    unsigned int eoc3            : 1;
    unsigned int eoc2            : 1;
    unsigned int eoc1            : 1;
    unsigned int eoc0            : 1;
} avr32_adc_imr_t;



typedef struct avr32_adc_cdr0_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr0_t;



typedef struct avr32_adc_cdr1_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr1_t;



typedef struct avr32_adc_cdr2_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr2_t;



typedef struct avr32_adc_cdr3_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr3_t;



typedef struct avr32_adc_cdr4_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr4_t;



typedef struct avr32_adc_cdr5_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr5_t;



typedef struct avr32_adc_cdr6_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr6_t;



typedef struct avr32_adc_cdr7_t {
    unsigned int                 :22;
    unsigned int data            :10;
} avr32_adc_cdr7_t;



typedef struct avr32_adc_version_t {
    unsigned int                 :13;
    unsigned int variant         : 3;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_adc_version_t;



typedef struct avr32_adc_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_adc_cr_t                 CR        ;
  };
  union {
          unsigned long                  mr        ;//0x0004
          avr32_adc_mr_t                 MR        ;
  };
          unsigned int                   :32       ;//0x0008
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  cher      ;//0x0010
          avr32_adc_cher_t               CHER      ;
  };
  union {
          unsigned long                  chdr      ;//0x0014
          avr32_adc_chdr_t               CHDR      ;
  };
  union {
    const unsigned long                  chsr      ;//0x0018
    const avr32_adc_chsr_t               CHSR      ;
  };
  union {
    const unsigned long                  sr        ;//0x001c
    const avr32_adc_sr_t                 SR        ;
  };
  union {
    const unsigned long                  lcdr      ;//0x0020
    const avr32_adc_lcdr_t               LCDR      ;
  };
  union {
          unsigned long                  ier       ;//0x0024
          avr32_adc_ier_t                IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0028
          avr32_adc_idr_t                IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x002c
    const avr32_adc_imr_t                IMR       ;
  };
  union {
    const unsigned long                  cdr0      ;//0x0030
    const avr32_adc_cdr0_t               CDR0      ;
  };
  union {
    const unsigned long                  cdr1      ;//0x0034
    const avr32_adc_cdr1_t               CDR1      ;
  };
  union {
    const unsigned long                  cdr2      ;//0x0038
    const avr32_adc_cdr2_t               CDR2      ;
  };
  union {
    const unsigned long                  cdr3      ;//0x003c
    const avr32_adc_cdr3_t               CDR3      ;
  };
  union {
    const unsigned long                  cdr4      ;//0x0040
    const avr32_adc_cdr4_t               CDR4      ;
  };
  union {
    const unsigned long                  cdr5      ;//0x0044
    const avr32_adc_cdr5_t               CDR5      ;
  };
  union {
    const unsigned long                  cdr6      ;//0x0048
    const avr32_adc_cdr6_t               CDR6      ;
  };
  union {
    const unsigned long                  cdr7      ;//0x004c
    const avr32_adc_cdr7_t               CDR7      ;
  };
          unsigned int                   :32       ;//0x0050
          unsigned int                   :32       ;//0x0054
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
  union {
    const unsigned long                  version   ;//0x00fc
    const avr32_adc_version_t            VERSION   ;
  };
} avr32_adc_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_ADC_200_H_INCLUDED*/
#endif

