/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_SSC_TSDAT_SIZE                                       16
#define AVR32_SSC_TSHR                                     0x00000034
#define AVR32_SSC_TSHR_TSDAT                                        0
#define AVR32_SSC_TSHR_TSDAT_MASK                          0x0000ffff
#define AVR32_SSC_TSHR_TSDAT_OFFSET                                 0
#define AVR32_SSC_TSHR_TSDAT_SIZE                                  16
#define AVR32_SSC_TXBUFE                                            3
#define AVR32_SSC_TXBUFE_MASK                              0x00000008
#define AVR32_SSC_TXBUFE_OFFSET                                     3
#define AVR32_SSC_TXBUFE_SIZE                                       1
#define AVR32_SSC_TXDIS                                             9
#define AVR32_SSC_TXDIS_MASK                               0x00000200
#define AVR32_SSC_TXDIS_OFFSET                                      9
#define AVR32_SSC_TXDIS_SIZE                                        1
#define AVR32_SSC_TXEMPTY                                           1
#define AVR32_SSC_TXEMPTY_MASK                             0x00000002
#define AVR32_SSC_TXEMPTY_OFFSET                                    1
#define AVR32_SSC_TXEMPTY_SIZE                                      1
#define AVR32_SSC_TXEN_SIZE                                         1
#define AVR32_SSC_TXRDY                                             0
#define AVR32_SSC_TXRDY_MASK                               0x00000001
#define AVR32_SSC_TXRDY_OFFSET                                      0
#define AVR32_SSC_TXRDY_SIZE                                        1
#define AVR32_SSC_TXSYN                                            10
#define AVR32_SSC_TXSYN_MASK                               0x00000400
#define AVR32_SSC_TXSYN_OFFSET                                     10
#define AVR32_SSC_TXSYN_SIZE                                        1
#define AVR32_SSC_VARIANT                                          16
#define AVR32_SSC_VARIANT_MASK                             0x00070000
#define AVR32_SSC_VARIANT_OFFSET                                   16
#define AVR32_SSC_VARIANT_SIZE                                      3
#define AVR32_SSC_VERSION                                  0x000000fc
#define AVR32_SSC_VERSION_MASK                             0x00000fff
#define AVR32_SSC_VERSION_OFFSET                                    0
#define AVR32_SSC_VERSION_SIZE                                     12
#define AVR32_SSC_VERSION_VARIANT                                  16
#define AVR32_SSC_VERSION_VARIANT_MASK                     0x00070000
#define AVR32_SSC_VERSION_VARIANT_OFFSET                           16
#define AVR32_SSC_VERSION_VARIANT_SIZE                              3
#define AVR32_SSC_VERSION_VERSION                                   0
#define AVR32_SSC_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_SSC_VERSION_VERSION_OFFSET                            0
#define AVR32_SSC_VERSION_VERSION_SIZE                             12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_ssc_cr_t {
    unsigned int                 :16;
    unsigned int swrst           : 1;
    unsigned int                 : 5;
    unsigned int txdis           : 1;
    unsigned int txen            : 1;
    unsigned int                 : 6;
    unsigned int rxdis           : 1;
    unsigned int rxen            : 1;
} avr32_ssc_cr_t;



typedef struct avr32_ssc_cmr_t {
    unsigned int                 :20;
    unsigned int div             :12;
} avr32_ssc_cmr_t;



typedef struct avr32_ssc_rcmr_t {
    unsigned int period          : 8;
    unsigned int sttdly          : 8;
    unsigned int                 : 3;
    unsigned int stop            : 1;
    unsigned int start           : 4;
    unsigned int ckg             : 2;
    unsigned int cki             : 1;
    unsigned int cko             : 3;
    unsigned int cks             : 2;
} avr32_ssc_rcmr_t;



typedef struct avr32_ssc_rfmr_t {
    unsigned int fslenhi         : 4;
    unsigned int                 : 3;
    unsigned int fsedge          : 1;
    unsigned int                 : 1;
    unsigned int fsos            : 3;
    unsigned int fslen           : 4;
    unsigned int                 : 4;
    unsigned int datnb           : 4;
    unsigned int msbf            : 1;
    unsigned int                 : 1;
    unsigned int loop            : 1;
    unsigned int datlen          : 5;
} avr32_ssc_rfmr_t;



typedef struct avr32_ssc_tcmr_t {
    unsigned int period          : 8;
    unsigned int sttdly          : 8;
    unsigned int                 : 4;
    unsigned int start           : 4;
    unsigned int ckg             : 2;
    unsigned int cki             : 1;
    unsigned int cko             : 3;
    unsigned int cks             : 2;
} avr32_ssc_tcmr_t;



typedef struct avr32_ssc_tfmr_t {
    unsigned int fslenhi         : 4;
    unsigned int                 : 3;
    unsigned int fsedge          : 1;
    unsigned int fsden           : 1;
    unsigned int fsos            : 3;
    unsigned int fslen           : 4;
    unsigned int                 : 4;
    unsigned int datnb           : 4;
    unsigned int msbf            : 1;
    unsigned int                 : 1;
    unsigned int datdef          : 1;
    unsigned int datlen          : 5;
} avr32_ssc_tfmr_t;



typedef struct avr32_ssc_rshr_t {
    unsigned int                 :16;
    unsigned int rsdat           :16;
} avr32_ssc_rshr_t;



typedef struct avr32_ssc_tshr_t {
    unsigned int                 :16;
    unsigned int tsdat           :16;
} avr32_ssc_tshr_t;



typedef struct avr32_ssc_rc0r_t {
    unsigned int                 :16;
    unsigned int cp0             :16;
} avr32_ssc_rc0r_t;



typedef struct avr32_ssc_rc1r_t {
    unsigned int                 :16;
    unsigned int cp1             :16;
} avr32_ssc_rc1r_t;



typedef struct avr32_ssc_sr_t {
    unsigned int                 :14;
    unsigned int rxen            : 1;
    unsigned int txen            : 1;
    unsigned int                 : 4;
    unsigned int rxsyn           : 1;
    unsigned int txsyn           : 1;
    unsigned int cp1             : 1;
    unsigned int cp0             : 1;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ssc_sr_t;



typedef struct avr32_ssc_ier_t {
    unsigned int                 :20;
    unsigned int rxsyn           : 1;
    unsigned int txsyn           : 1;
    unsigned int cp1             : 1;
    unsigned int cp0             : 1;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ssc_ier_t;



typedef struct avr32_ssc_idr_t {
    unsigned int                 :20;
    unsigned int rxsyn           : 1;
    unsigned int txsyn           : 1;
    unsigned int cp1             : 1;
    unsigned int cp0             : 1;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ssc_idr_t;



typedef struct avr32_ssc_imr_t {
    unsigned int                 :20;
    unsigned int rxsyn           : 1;
    unsigned int txsyn           : 1;
    unsigned int cp1             : 1;
    unsigned int cp0             : 1;
    unsigned int rxbuff          : 1;
    unsigned int endrx           : 1;
    unsigned int ovrun           : 1;
    unsigned int rxrdy           : 1;
    unsigned int txbufe          : 1;
    unsigned int endtx           : 1;
    unsigned int txempty         : 1;
    unsigned int txrdy           : 1;
} avr32_ssc_imr_t;



typedef struct avr32_ssc_version_t {
    unsigned int                 :13;
    unsigned int variant         : 3;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_ssc_version_t;



typedef struct avr32_ssc_t {
  union {
          unsigned long                  cr        ;//0x0000
          avr32_ssc_cr_t                 CR        ;
  };
  union {
          unsigned long                  cmr       ;//0x0004
          avr32_ssc_cmr_t                CMR       ;
  };
          unsigned int                   :32       ;//0x0008
          unsigned int                   :32       ;//0x000c
  union {
          unsigned long                  rcmr      ;//0x0010
          avr32_ssc_rcmr_t               RCMR      ;
  };
  union {
          unsigned long                  rfmr      ;//0x0014
          avr32_ssc_rfmr_t               RFMR      ;
  };
  union {
          unsigned long                  tcmr      ;//0x0018
          avr32_ssc_tcmr_t               TCMR      ;
  };
  union {
          unsigned long                  tfmr      ;//0x001c
          avr32_ssc_tfmr_t               TFMR      ;
  };
    const unsigned long                  rhr       ;//0x0020
          unsigned long                  thr       ;//0x0024
          unsigned int                   :32       ;//0x0028
          unsigned int                   :32       ;//0x002c
  union {
    const unsigned long                  rshr      ;//0x0030
    const avr32_ssc_rshr_t               RSHR      ;
  };
  union {
          unsigned long                  tshr      ;//0x0034
          avr32_ssc_tshr_t               TSHR      ;
  };
  union {
          unsigned long                  rc0r      ;//0x0038
          avr32_ssc_rc0r_t               RC0R      ;
  };
  union {
          unsigned long                  rc1r      ;//0x003c
          avr32_ssc_rc1r_t               RC1R      ;
  };
  union {
    const unsigned long                  sr        ;//0x0040
    const avr32_ssc_sr_t                 SR        ;
  };
  union {
          unsigned long                  ier       ;//0x0044
          avr32_ssc_ier_t                IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0048
          avr32_ssc_idr_t                IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x004c
    const avr32_ssc_imr_t                IMR       ;
  };
          unsigned int                   :32       ;//0x0050
          unsigned int                   :32       ;//0x0054
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
  union {
    const unsigned long                  version   ;//0x00fc
    const avr32_ssc_version_t            VERSION   ;
  };
} avr32_ssc_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif


#if !defined (DEPRECATED_DISABLE)

#define AVR32_SSC_DETECT_ANY_EGDE_RF                       0x00000007

#define AVR32_SSC_RCMR_START_DETECT_ANY_EGDE_RF            0x00000007

#define AVR32_SSC_START_DETECT_ANY_EGDE_RF                 0x00000007

#define AVR32_SSC_TCMR_START_DETECT_ANY_EGDE_RF            0x00000007
#define AVR32_SSC_TCMR_START_DETECT_FALLING_RF             0x00000004
#define AVR32_SSC_TCMR_START_DETECT_HIGH_RF                0x00000003
#define AVR32_SSC_TCMR_START_DETECT_LEVEL_CHANGE_RF        0x00000006
#define AVR32_SSC_TCMR_START_DETECT_LOW_RF                 0x00000002
#define AVR32_SSC_TCMR_START_DETECT_RISING_RF              0x00000005

#endif


/*#ifdef AVR32_SSC_310_H_INCLUDED*/
#endif

