/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_USBB_VBUSRQ_SIZE                                       1
#define AVR32_USBB_VBUSTE                                            1
#define AVR32_USBB_VBUSTE_MASK                              0x00000002
#define AVR32_USBB_VBUSTE_OFFSET                                     1
#define AVR32_USBB_VBUSTE_SIZE                                       1
#define AVR32_USBB_VBUSTIC_SIZE                                      1
#define AVR32_USBB_VBUSTIS_SIZE                                      1
#define AVR32_USBB_VBUSTI_SIZE                                       1
#define AVR32_USBB_VBUS_SIZE                                         1
#define AVR32_USBB_VB_BUS_PULSING                           0x00000001
#define AVR32_USBB_VB_BUS_PULSING_15_MS                     0x00000000
#define AVR32_USBB_VB_BUS_PULSING_23_MS                     0x00000001
#define AVR32_USBB_VB_BUS_PULSING_31_MS                     0x00000002
#define AVR32_USBB_VB_BUS_PULSING_40_MS                     0x00000003
#define AVR32_USBB_VERSION_NUM                                       0
#define AVR32_USBB_VERSION_NUM_MASK                         0x0000ffff
#define AVR32_USBB_VERSION_NUM_OFFSET                                0
#define AVR32_USBB_VERSION_NUM_SIZE                                 16
#define AVR32_USBB_WAKEUP                                            4
#define AVR32_USBB_WAKEUPC                                           4
#define AVR32_USBB_WAKEUPC_MASK                             0x00000010
#define AVR32_USBB_WAKEUPC_OFFSET                                    4
#define AVR32_USBB_WAKEUPC_SIZE                                      1
#define AVR32_USBB_WAKEUPE                                           4
#define AVR32_USBB_WAKEUPEC                                          4
#define AVR32_USBB_WAKEUPEC_MASK                            0x00000010
#define AVR32_USBB_WAKEUPEC_OFFSET                                   4
#define AVR32_USBB_WAKEUPEC_SIZE                                     1
#define AVR32_USBB_WAKEUPES                                          4
#define AVR32_USBB_WAKEUPES_MASK                            0x00000010
#define AVR32_USBB_WAKEUPES_OFFSET                                   4
#define AVR32_USBB_WAKEUPES_SIZE                                     1
#define AVR32_USBB_WAKEUPE_MASK                             0x00000010
#define AVR32_USBB_WAKEUPE_OFFSET                                    4
#define AVR32_USBB_WAKEUPE_SIZE                                      1
#define AVR32_USBB_WAKEUPS                                           4
#define AVR32_USBB_WAKEUPS_MASK                             0x00000010
#define AVR32_USBB_WAKEUPS_OFFSET                                    4
#define AVR32_USBB_WAKEUPS_SIZE                                      1
#define AVR32_USBB_WAKEUP_MASK                              0x00000010
#define AVR32_USBB_WAKEUP_OFFSET                                     4
#define AVR32_USBB_WAKEUP_SIZE                                       1




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_usbb_udcon_t {
    unsigned int                 :13;
    unsigned int frzclk          : 1;
    unsigned int usbe            : 1;
    unsigned int opmode2         : 1;
    unsigned int tstpckt         : 1;
    unsigned int tstk            : 1;
    unsigned int tstj            : 1;
    unsigned int ls              : 1;
    unsigned int spdconf         : 2;
    unsigned int rmwkup          : 1;
    unsigned int detach          : 1;
    unsigned int adden           : 1;
    unsigned int uadd            : 7;
} avr32_usbb_udcon_t;



typedef struct avr32_usbb_udint_t {
    unsigned int                 : 1;
    unsigned int dma6int         : 1;
    unsigned int dma5int         : 1;
    unsigned int dma4int         : 1;
    unsigned int dma3int         : 1;
    unsigned int dma2int         : 1;
    unsigned int dma1int         : 1;
    unsigned int                 : 6;
    unsigned int ep6int          : 1;
    unsigned int ep5int          : 1;
    unsigned int ep4int          : 1;
    unsigned int ep3int          : 1;
    unsigned int ep2int          : 1;
    unsigned int ep1int          : 1;
    unsigned int ep0int          : 1;
    unsigned int                 : 1;
    unsigned int clkusable       : 1;
    unsigned int speed           : 1;
    unsigned int vbus            : 1;
    unsigned int vbusti          : 1;
    unsigned int uprsm           : 1;
    unsigned int eorsm           : 1;
    unsigned int wakeup          : 1;
    unsigned int eorst           : 1;
    unsigned int sof             : 1;
    unsigned int msof            : 1;
    unsigned int susp            : 1;
} avr32_usbb_udint_t;



typedef struct avr32_usbb_udintclr_t {
    unsigned int                 :24;
    unsigned int vbustic         : 1;
    unsigned int uprsmc          : 1;
    unsigned int eorsmc          : 1;
    unsigned int wakeupc         : 1;
    unsigned int eorstc          : 1;
    unsigned int sofc            : 1;
    unsigned int msofc           : 1;
    unsigned int suspc           : 1;
} avr32_usbb_udintclr_t;



typedef struct avr32_usbb_udintset_t {
    unsigned int                 : 1;
    unsigned int dma6ints        : 1;
    unsigned int dma5ints        : 1;
    unsigned int dma4ints        : 1;
    unsigned int dma3ints        : 1;
    unsigned int dma2ints        : 1;
    unsigned int dma1ints        : 1;
    unsigned int                 :17;
    unsigned int vbustis         : 1;
    unsigned int uprsms          : 1;
    unsigned int eorsms          : 1;
    unsigned int wakeups         : 1;
    unsigned int eorsts          : 1;
    unsigned int sofs            : 1;
    unsigned int msofs           : 1;
    unsigned int susps           : 1;
} avr32_usbb_udintset_t;



typedef struct avr32_usbb_udinte_t {
    unsigned int                 : 1;
    unsigned int dma6inte        : 1;
    unsigned int dma5inte        : 1;
    unsigned int dma4inte        : 1;
    unsigned int dma3inte        : 1;
    unsigned int dma2inte        : 1;
    unsigned int dma1inte        : 1;
    unsigned int                 : 6;
    unsigned int ep6inte         : 1;
    unsigned int ep5inte         : 1;
    unsigned int ep4inte         : 1;
    unsigned int ep3inte         : 1;
    unsigned int ep2inte         : 1;
    unsigned int ep1inte         : 1;
    unsigned int ep0inte         : 1;
    unsigned int                 : 4;
    unsigned int vbuse           : 1;
    unsigned int uprsme          : 1;
    unsigned int eorsme          : 1;
    unsigned int wakeupe         : 1;
    unsigned int eorste          : 1;
    unsigned int sofe            : 1;
    unsigned int msofe           : 1;
    unsigned int suspe           : 1;
} avr32_usbb_udinte_t;



typedef struct avr32_usbb_udinteclr_t {
    unsigned int                 : 1;
    unsigned int dam6intec       : 1;
    unsigned int dma5intec       : 1;
    unsigned int dma4intec       : 1;
    unsigned int dma3intec       : 1;
    unsigned int dma2intec       : 1;
    unsigned int dma1intec       : 1;
    unsigned int                 : 6;
    unsigned int ep6intec        : 1;
    unsigned int ep5intec        : 1;
    unsigned int ep4intec        : 1;
    unsigned int ep3intec        : 1;
    unsigned int ep2intec        : 1;
    unsigned int ep1intec        : 1;
    unsigned int ep0intec        : 1;
    unsigned int                 : 4;
    unsigned int vbusec          : 1;
    unsigned int uprsmec         : 1;
    unsigned int eorsmec         : 1;
    unsigned int wakeupec        : 1;
    unsigned int eorstec         : 1;
    unsigned int sofec           : 1;
    unsigned int msofec          : 1;
    unsigned int suspec          : 1;
} avr32_usbb_udinteclr_t;



typedef struct avr32_usbb_udinteset_t {
    unsigned int                 : 1;
    unsigned int dma6intes       : 1;
    unsigned int dma5intes       : 1;
    unsigned int dma4intes       : 1;
    unsigned int dma3intes       : 1;
    unsigned int dma2intes       : 1;
    unsigned int dma1intes       : 1;
    unsigned int                 : 6;
    unsigned int ep6intes        : 1;
    unsigned int ep5intes        : 1;
    unsigned int ep4intes        : 1;
    unsigned int ep3intes        : 1;
    unsigned int ep2intes        : 1;
    unsigned int ep1intes        : 1;
    unsigned int ep0intes        : 1;
    unsigned int                 : 4;
    unsigned int vbuses          : 1;
    unsigned int uprsmes         : 1;
    unsigned int eorsmes         : 1;
    unsigned int wakeupes        : 1;
    unsigned int eorstes         : 1;
    unsigned int sofes           : 1;
    unsigned int msofes          : 1;
    unsigned int suspes          : 1;
} avr32_usbb_udinteset_t;



typedef struct avr32_usbb_uerst_t {
    unsigned int                 : 9;
    unsigned int eprst6          : 1;
    unsigned int eprst5          : 1;
    unsigned int eprst4          : 1;
    unsigned int eprst3          : 1;
    unsigned int eprst2          : 1;
    unsigned int eprst1          : 1;
    unsigned int eprst0          : 1;
    unsigned int                 : 9;
    unsigned int epen6           : 1;
    unsigned int epen5           : 1;
    unsigned int epen4           : 1;
    unsigned int epen3           : 1;
    unsigned int epen2           : 1;
    unsigned int epen1           : 1;
    unsigned int epen0           : 1;
} avr32_usbb_uerst_t;



typedef struct avr32_usbb_udfnum_t {
    unsigned int                 :16;
    unsigned int fncerr          : 1;
    unsigned int                 : 1;
    unsigned int fnum            :11;
    unsigned int mfnum           : 3;
} avr32_usbb_udfnum_t;



typedef struct avr32_usbb_udtst1_t {
    unsigned int loadsofcnt      : 1;
    unsigned int sofcntmax       : 7;
    unsigned int loadcntb        : 1;
    unsigned int                 : 1;
    unsigned int counterb        : 6;
    unsigned int loadcnta        : 1;
    unsigned int countera        :15;
} avr32_usbb_udtst1_t;



typedef struct avr32_usbb_udtst2_t {
    unsigned int                 :25;
    unsigned int nothostdisconnect : 1;
    unsigned int bypassdpll      : 1;
    unsigned int forcesuspendmto1 : 1;
    unsigned int disbalegatedclock : 1;
    unsigned int loopbackmode    : 1;
    unsigned int hsserialmode    : 1;
    unsigned int fulldetachen    : 1;
} avr32_usbb_udtst2_t;



typedef struct avr32_usbb_udfeatures_t {
    unsigned int en_high_bd_iso_ept_15 : 1;
    unsigned int en_high_bd_iso_ept_14 : 1;
    unsigned int en_high_bd_iso_ept_13 : 1;
    unsigned int en_high_bd_iso_ept_12 : 1;
    unsigned int en_high_bd_iso_ept_11 : 1;
    unsigned int en_high_bd_iso_ept_10 : 1;
    unsigned int en_high_bd_iso_ept_9 : 1;
    unsigned int en_high_bd_iso_ept_8 : 1;
    unsigned int en_high_bd_iso_ept_7 : 1;
    unsigned int en_high_bd_iso_ept_6 : 1;
    unsigned int en_high_bd_iso_ept_5 : 1;
    unsigned int en_high_bd_iso_ept_4 : 1;
    unsigned int en_high_bd_iso_ept_3 : 1;
    unsigned int en_high_bd_iso_ept_2 : 1;
    unsigned int en_high_bd_iso_ept_1 : 1;
    unsigned int data_bus_8_16   : 1;
    unsigned int byte_write_dpram : 1;
    unsigned int fifo_max_size   : 3;
    unsigned int dma_fifo_word_depth : 4;
    unsigned int dma_buffer_size : 1;
    unsigned int dma_channel_nbr : 3;
    unsigned int ept_nbr_max     : 4;
} avr32_usbb_udfeatures_t;



typedef struct avr32_usbb_uecfg0_t {
    unsigned int datasizerdwr    : 2;
    unsigned int                 :15;
    unsigned int nbtrans         : 2;
    unsigned int eptype          : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int epdir           : 1;
    unsigned int                 : 1;
    unsigned int epsize          : 3;
    unsigned int epbk            : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_uecfg0_t;



typedef struct avr32_usbb_uecfg1_t {
    unsigned int datasizerdwr    : 2;
    unsigned int                 :15;
    unsigned int nbtrans         : 2;
    unsigned int eptype          : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int epdir           : 1;
    unsigned int                 : 1;
    unsigned int epsize          : 3;
    unsigned int epbk            : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_uecfg1_t;



typedef struct avr32_usbb_uecfg2_t {
    unsigned int datasizerdwr    : 2;
    unsigned int                 :15;
    unsigned int nbtrans         : 2;
    unsigned int eptype          : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int epdir           : 1;
    unsigned int                 : 1;
    unsigned int epsize          : 3;
    unsigned int epbk            : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_uecfg2_t;



typedef struct avr32_usbb_uecfg3_t {
    unsigned int datasizerdwr    : 2;
    unsigned int                 :15;
    unsigned int nbtrans         : 2;
    unsigned int eptype          : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int epdir           : 1;
    unsigned int                 : 1;
    unsigned int epsize          : 3;
    unsigned int epbk            : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_uecfg3_t;



typedef struct avr32_usbb_uecfg4_t {
    unsigned int datasizerdwr    : 2;
    unsigned int                 :15;
    unsigned int nbtrans         : 2;
    unsigned int eptype          : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int epdir           : 1;
    unsigned int                 : 1;
    unsigned int epsize          : 3;
    unsigned int epbk            : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_uecfg4_t;



typedef struct avr32_usbb_uecfg5_t {
    unsigned int datasizerdwr    : 2;
    unsigned int                 :15;
    unsigned int nbtrans         : 2;
    unsigned int eptype          : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int epdir           : 1;
    unsigned int                 : 1;
    unsigned int epsize          : 3;
    unsigned int epbk            : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_uecfg5_t;



typedef struct avr32_usbb_uecfg6_t {
    unsigned int datasizerdwr    : 2;
    unsigned int                 :15;
    unsigned int nbtrans         : 2;
    unsigned int eptype          : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int epdir           : 1;
    unsigned int                 : 1;
    unsigned int epsize          : 3;
    unsigned int epbk            : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_uecfg6_t;



typedef struct avr32_usbb_uesta0_t {
    unsigned int                 : 1;
    unsigned int byct            :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int ctrldir         : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 1;
    unsigned int errortrans      : 1;
    unsigned int dtseq           : 2;
    unsigned int shortpacket     : 1;
    unsigned int stalledi        : 1;
    unsigned int overfi          : 1;
    unsigned int nakini          : 1;
    unsigned int nakouti         : 1;
    unsigned int rxstpi          : 1;
    unsigned int rxouti          : 1;
    unsigned int txini           : 1;
} avr32_usbb_uesta0_t;



typedef struct avr32_usbb_uesta1_t {
    unsigned int                 : 1;
    unsigned int byct            :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int ctrldir         : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 1;
    unsigned int errortrans      : 1;
    unsigned int dtseq           : 2;
    unsigned int shortpacket     : 1;
    unsigned int stalledi        : 1;
    unsigned int overfi          : 1;
    unsigned int nakini          : 1;
    unsigned int nakouti         : 1;
    unsigned int rxstpi          : 1;
    unsigned int rxouti          : 1;
    unsigned int txini           : 1;
} avr32_usbb_uesta1_t;



typedef struct avr32_usbb_uesta2_t {
    unsigned int                 : 1;
    unsigned int byct            :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int ctrldir         : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 1;
    unsigned int errortrans      : 1;
    unsigned int dtseq           : 2;
    unsigned int shortpacket     : 1;
    unsigned int stalledi        : 1;
    unsigned int overfi          : 1;
    unsigned int nakini          : 1;
    unsigned int nakouti         : 1;
    unsigned int rxstpi          : 1;
    unsigned int rxouti          : 1;
    unsigned int txini           : 1;
} avr32_usbb_uesta2_t;



typedef struct avr32_usbb_uesta3_t {
    unsigned int                 : 1;
    unsigned int byct            :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int ctrldir         : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 1;
    unsigned int errortrans      : 1;
    unsigned int dtseq           : 2;
    unsigned int shortpacket     : 1;
    unsigned int stalledi        : 1;
    unsigned int overfi          : 1;
    unsigned int nakini          : 1;
    unsigned int nakouti         : 1;
    unsigned int rxstpi          : 1;
    unsigned int rxouti          : 1;
    unsigned int txini           : 1;
} avr32_usbb_uesta3_t;



typedef struct avr32_usbb_uesta4_t {
    unsigned int                 : 1;
    unsigned int byct            :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int ctrldir         : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 1;
    unsigned int errortrans      : 1;
    unsigned int dtseq           : 2;
    unsigned int shortpacket     : 1;
    unsigned int stalledi        : 1;
    unsigned int overfi          : 1;
    unsigned int nakini          : 1;
    unsigned int nakouti         : 1;
    unsigned int rxstpi          : 1;
    unsigned int rxouti          : 1;
    unsigned int txini           : 1;
} avr32_usbb_uesta4_t;



typedef struct avr32_usbb_uesta5_t {
    unsigned int                 : 1;
    unsigned int byct            :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int ctrldir         : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 1;
    unsigned int errortrans      : 1;
    unsigned int dtseq           : 2;
    unsigned int shortpacket     : 1;
    unsigned int stalledi        : 1;
    unsigned int overfi          : 1;
    unsigned int nakini          : 1;
    unsigned int nakouti         : 1;
    unsigned int rxstpi          : 1;
    unsigned int rxouti          : 1;
    unsigned int txini           : 1;
} avr32_usbb_uesta5_t;



typedef struct avr32_usbb_uesta6_t {
    unsigned int                 : 1;
    unsigned int byct            :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int ctrldir         : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 1;
    unsigned int errortrans      : 1;
    unsigned int dtseq           : 2;
    unsigned int shortpacket     : 1;
    unsigned int stalledi        : 1;
    unsigned int overfi          : 1;
    unsigned int nakini          : 1;
    unsigned int nakouti         : 1;
    unsigned int rxstpi          : 1;
    unsigned int rxouti          : 1;
    unsigned int txini           : 1;
} avr32_usbb_uesta6_t;



typedef struct avr32_usbb_uesta0clr_t {
    unsigned int                 :24;
    unsigned int shortpacketc    : 1;
    unsigned int stalledic       : 1;
    unsigned int overfic         : 1;
    unsigned int nakinic         : 1;
    unsigned int nakoutic        : 1;
    unsigned int rxstpic         : 1;
    unsigned int rxoutic         : 1;
    unsigned int txinic          : 1;
} avr32_usbb_uesta0clr_t;



typedef struct avr32_usbb_uesta1clr_t {
    unsigned int                 :24;
    unsigned int shortpacketc    : 1;
    unsigned int stalledic       : 1;
    unsigned int overfic         : 1;
    unsigned int nakinic         : 1;
    unsigned int nakoutic        : 1;
    unsigned int rxstpic         : 1;
    unsigned int rxoutic         : 1;
    unsigned int txinic          : 1;
} avr32_usbb_uesta1clr_t;



typedef struct avr32_usbb_uesta2clr_t {
    unsigned int                 :24;
    unsigned int shortpacketc    : 1;
    unsigned int stalledic       : 1;
    unsigned int overfic         : 1;
    unsigned int nakinic         : 1;
    unsigned int nakoutic        : 1;
    unsigned int rxstpic         : 1;
    unsigned int rxoutic         : 1;
    unsigned int txinic          : 1;
} avr32_usbb_uesta2clr_t;



typedef struct avr32_usbb_uesta3clr_t {
    unsigned int                 :24;
    unsigned int shortpacketc    : 1;
    unsigned int stalledic       : 1;
    unsigned int overfic         : 1;
    unsigned int nakinic         : 1;
    unsigned int nakoutic        : 1;
    unsigned int rxstpic         : 1;
    unsigned int rxoutic         : 1;
    unsigned int txinic          : 1;
} avr32_usbb_uesta3clr_t;



typedef struct avr32_usbb_uesta4clr_t {
    unsigned int                 :24;
    unsigned int shortpacketc    : 1;
    unsigned int stalledic       : 1;
    unsigned int overfic         : 1;
    unsigned int nakinic         : 1;
    unsigned int nakoutic        : 1;
    unsigned int rxstpic         : 1;
    unsigned int rxoutic         : 1;
    unsigned int txinic          : 1;
} avr32_usbb_uesta4clr_t;



typedef struct avr32_usbb_uesta5clr_t {
    unsigned int                 :24;
    unsigned int shortpacketc    : 1;
    unsigned int stalledic       : 1;
    unsigned int overfic         : 1;
    unsigned int nakinic         : 1;
    unsigned int nakoutic        : 1;
    unsigned int rxstpic         : 1;
    unsigned int rxoutic         : 1;
    unsigned int txinic          : 1;
} avr32_usbb_uesta5clr_t;



typedef struct avr32_usbb_uesta6clr_t {
    unsigned int                 :24;
    unsigned int shortpacketc    : 1;
    unsigned int stalledic       : 1;
    unsigned int overfic         : 1;
    unsigned int nakinic         : 1;
    unsigned int nakoutic        : 1;
    unsigned int rxstpic         : 1;
    unsigned int rxoutic         : 1;
    unsigned int txinic          : 1;
} avr32_usbb_uesta6clr_t;



typedef struct avr32_usbb_uesta0set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 1;
    unsigned int errortranss     : 1;
    unsigned int                 : 1;
    unsigned int setmdata        : 1;
    unsigned int shortpackets    : 1;
    unsigned int stalledis       : 1;
    unsigned int overfis         : 1;
    unsigned int nakinis         : 1;
    unsigned int nakoutis        : 1;
    unsigned int rxstpis         : 1;
    unsigned int rxoutis         : 1;
    unsigned int txinis          : 1;
} avr32_usbb_uesta0set_t;



typedef struct avr32_usbb_uesta1set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 1;
    unsigned int errortranss     : 1;
    unsigned int                 : 1;
    unsigned int setmdata        : 1;
    unsigned int shortpackets    : 1;
    unsigned int stalledis       : 1;
    unsigned int overfis         : 1;
    unsigned int nakinis         : 1;
    unsigned int nakoutis        : 1;
    unsigned int rxstpis         : 1;
    unsigned int rxoutis         : 1;
    unsigned int txinis          : 1;
} avr32_usbb_uesta1set_t;



typedef struct avr32_usbb_uesta2set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 1;
    unsigned int errortranss     : 1;
    unsigned int                 : 1;
    unsigned int setmdata        : 1;
    unsigned int shortpackets    : 1;
    unsigned int stalledis       : 1;
    unsigned int overfis         : 1;
    unsigned int nakinis         : 1;
    unsigned int nakoutis        : 1;
    unsigned int rxstpis         : 1;
    unsigned int rxoutis         : 1;
    unsigned int txinis          : 1;
} avr32_usbb_uesta2set_t;



typedef struct avr32_usbb_uesta3set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 1;
    unsigned int errortranss     : 1;
    unsigned int                 : 1;
    unsigned int setmdata        : 1;
    unsigned int shortpackets    : 1;
    unsigned int stalledis       : 1;
    unsigned int overfis         : 1;
    unsigned int nakinis         : 1;
    unsigned int nakoutis        : 1;
    unsigned int rxstpis         : 1;
    unsigned int rxoutis         : 1;
    unsigned int txinis          : 1;
} avr32_usbb_uesta3set_t;



typedef struct avr32_usbb_uesta4set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 1;
    unsigned int errortranss     : 1;
    unsigned int                 : 1;
    unsigned int setmdata        : 1;
    unsigned int shortpackets    : 1;
    unsigned int stalledis       : 1;
    unsigned int overfis         : 1;
    unsigned int nakinis         : 1;
    unsigned int nakoutis        : 1;
    unsigned int rxstpis         : 1;
    unsigned int rxoutis         : 1;
    unsigned int txinis          : 1;
} avr32_usbb_uesta4set_t;



typedef struct avr32_usbb_uesta5set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 1;
    unsigned int errortranss     : 1;
    unsigned int                 : 1;
    unsigned int setmdata        : 1;
    unsigned int shortpackets    : 1;
    unsigned int stalledis       : 1;
    unsigned int overfis         : 1;
    unsigned int nakinis         : 1;
    unsigned int nakoutis        : 1;
    unsigned int rxstpis         : 1;
    unsigned int rxoutis         : 1;
    unsigned int txinis          : 1;
} avr32_usbb_uesta5set_t;



typedef struct avr32_usbb_uesta6set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 1;
    unsigned int errortranss     : 1;
    unsigned int                 : 1;
    unsigned int setmdata        : 1;
    unsigned int shortpackets    : 1;
    unsigned int stalledis       : 1;
    unsigned int overfis         : 1;
    unsigned int nakinis         : 1;
    unsigned int nakoutis        : 1;
    unsigned int rxstpis         : 1;
    unsigned int rxoutis         : 1;
    unsigned int txinis          : 1;
} avr32_usbb_uesta6set_t;



typedef struct avr32_usbb_uecon0_t {
    unsigned int                 :12;
    unsigned int stallrq         : 1;
    unsigned int rstdt           : 1;
    unsigned int nyetdis         : 1;
    unsigned int epdishdma       : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int killbk          : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 1;
    unsigned int errortranse     : 1;
    unsigned int dataxe          : 1;
    unsigned int mdatae          : 1;
    unsigned int shortpackete    : 1;
    unsigned int stallede        : 1;
    unsigned int overfe          : 1;
    unsigned int nakine          : 1;
    unsigned int nakoute         : 1;
    unsigned int rxstpe          : 1;
    unsigned int rxoute          : 1;
    unsigned int txine           : 1;
} avr32_usbb_uecon0_t;



typedef struct avr32_usbb_uecon1_t {
    unsigned int                 :12;
    unsigned int stallrq         : 1;
    unsigned int rstdt           : 1;
    unsigned int nyetdis         : 1;
    unsigned int epdishdma       : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int killbk          : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 1;
    unsigned int errortranse     : 1;
    unsigned int dataxe          : 1;
    unsigned int mdatae          : 1;
    unsigned int shortpackete    : 1;
    unsigned int stallede        : 1;
    unsigned int overfe          : 1;
    unsigned int nakine          : 1;
    unsigned int nakoute         : 1;
    unsigned int rxstpe          : 1;
    unsigned int rxoute          : 1;
    unsigned int txine           : 1;
} avr32_usbb_uecon1_t;



typedef struct avr32_usbb_uecon2_t {
    unsigned int                 :12;
    unsigned int stallrq         : 1;
    unsigned int rstdt           : 1;
    unsigned int nyetdis         : 1;
    unsigned int epdishdma       : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int killbk          : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 1;
    unsigned int errortranse     : 1;
    unsigned int dataxe          : 1;
    unsigned int mdatae          : 1;
    unsigned int shortpackete    : 1;
    unsigned int stallede        : 1;
    unsigned int overfe          : 1;
    unsigned int nakine          : 1;
    unsigned int nakoute         : 1;
    unsigned int rxstpe          : 1;
    unsigned int rxoute          : 1;
    unsigned int txine           : 1;
} avr32_usbb_uecon2_t;



typedef struct avr32_usbb_uecon3_t {
    unsigned int                 :12;
    unsigned int stallrq         : 1;
    unsigned int rstdt           : 1;
    unsigned int nyetdis         : 1;
    unsigned int epdishdma       : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int killbk          : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 1;
    unsigned int errortranse     : 1;
    unsigned int dataxe          : 1;
    unsigned int mdatae          : 1;
    unsigned int shortpackete    : 1;
    unsigned int stallede        : 1;
    unsigned int overfe          : 1;
    unsigned int nakine          : 1;
    unsigned int nakoute         : 1;
    unsigned int rxstpe          : 1;
    unsigned int rxoute          : 1;
    unsigned int txine           : 1;
} avr32_usbb_uecon3_t;



typedef struct avr32_usbb_uecon4_t {
    unsigned int                 :12;
    unsigned int stallrq         : 1;
    unsigned int rstdt           : 1;
    unsigned int nyetdis         : 1;
    unsigned int epdishdma       : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int killbk          : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 1;
    unsigned int errortranse     : 1;
    unsigned int dataxe          : 1;
    unsigned int mdatae          : 1;
    unsigned int shortpackete    : 1;
    unsigned int stallede        : 1;
    unsigned int overfe          : 1;
    unsigned int nakine          : 1;
    unsigned int nakoute         : 1;
    unsigned int rxstpe          : 1;
    unsigned int rxoute          : 1;
    unsigned int txine           : 1;
} avr32_usbb_uecon4_t;



typedef struct avr32_usbb_uecon5_t {
    unsigned int                 :12;
    unsigned int stallrq         : 1;
    unsigned int rstdt           : 1;
    unsigned int nyetdis         : 1;
    unsigned int epdishdma       : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int killbk          : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 1;
    unsigned int errortranse     : 1;
    unsigned int dataxe          : 1;
    unsigned int mdatae          : 1;
    unsigned int shortpackete    : 1;
    unsigned int stallede        : 1;
    unsigned int overfe          : 1;
    unsigned int nakine          : 1;
    unsigned int nakoute         : 1;
    unsigned int rxstpe          : 1;
    unsigned int rxoute          : 1;
    unsigned int txine           : 1;
} avr32_usbb_uecon5_t;



typedef struct avr32_usbb_uecon6_t {
    unsigned int                 :12;
    unsigned int stallrq         : 1;
    unsigned int rstdt           : 1;
    unsigned int nyetdis         : 1;
    unsigned int epdishdma       : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int killbk          : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 1;
    unsigned int errortranse     : 1;
    unsigned int dataxe          : 1;
    unsigned int mdatae          : 1;
    unsigned int shortpackete    : 1;
    unsigned int stallede        : 1;
    unsigned int overfe          : 1;
    unsigned int nakine          : 1;
    unsigned int nakoute         : 1;
    unsigned int rxstpe          : 1;
    unsigned int rxoute          : 1;
    unsigned int txine           : 1;
} avr32_usbb_uecon6_t;



typedef struct avr32_usbb_uecon0set_t {
    unsigned int                 :12;
    unsigned int stallrqs        : 1;
    unsigned int rstdts          : 1;
    unsigned int nyetdiss        : 1;
    unsigned int epdishdmas      : 1;
    unsigned int                 : 2;
    unsigned int killbks         : 1;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 1;
    unsigned int errortranses    : 1;
    unsigned int dataxes         : 1;
    unsigned int mdataes         : 1;
    unsigned int shortpacketes   : 1;
    unsigned int stalledes       : 1;
    unsigned int overfes         : 1;
    unsigned int nakines         : 1;
    unsigned int nakoutes        : 1;
    unsigned int rxstpes         : 1;
    unsigned int rxoutes         : 1;
    unsigned int txines          : 1;
} avr32_usbb_uecon0set_t;



typedef struct avr32_usbb_uecon1set_t {
    unsigned int                 :12;
    unsigned int stallrqs        : 1;
    unsigned int rstdts          : 1;
    unsigned int nyetdiss        : 1;
    unsigned int epdishdmas      : 1;
    unsigned int                 : 2;
    unsigned int killbks         : 1;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 1;
    unsigned int errortranses    : 1;
    unsigned int dataxes         : 1;
    unsigned int mdataes         : 1;
    unsigned int shortpacketes   : 1;
    unsigned int stalledes       : 1;
    unsigned int overfes         : 1;
    unsigned int nakines         : 1;
    unsigned int nakoutes        : 1;
    unsigned int rxstpes         : 1;
    unsigned int rxoutes         : 1;
    unsigned int txines          : 1;
} avr32_usbb_uecon1set_t;



typedef struct avr32_usbb_uecon2set_t {
    unsigned int                 :12;
    unsigned int stallrqs        : 1;
    unsigned int rstdts          : 1;
    unsigned int nyetdiss        : 1;
    unsigned int epdishdmas      : 1;
    unsigned int                 : 2;
    unsigned int killbks         : 1;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 1;
    unsigned int errortranses    : 1;
    unsigned int dataxes         : 1;
    unsigned int mdataes         : 1;
    unsigned int shortpacketes   : 1;
    unsigned int stalledes       : 1;
    unsigned int overfes         : 1;
    unsigned int nakines         : 1;
    unsigned int nakoutes        : 1;
    unsigned int rxstpes         : 1;
    unsigned int rxoutes         : 1;
    unsigned int txines          : 1;
} avr32_usbb_uecon2set_t;



typedef struct avr32_usbb_uecon3set_t {
    unsigned int                 :12;
    unsigned int stallrqs        : 1;
    unsigned int rstdts          : 1;
    unsigned int nyetdiss        : 1;
    unsigned int epdishdmas      : 1;
    unsigned int                 : 2;
    unsigned int killbks         : 1;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 1;
    unsigned int errortranses    : 1;
    unsigned int dataxes         : 1;
    unsigned int mdataes         : 1;
    unsigned int shortpacketes   : 1;
    unsigned int stalledes       : 1;
    unsigned int overfes         : 1;
    unsigned int nakines         : 1;
    unsigned int nakoutes        : 1;
    unsigned int rxstpes         : 1;
    unsigned int rxoutes         : 1;
    unsigned int txines          : 1;
} avr32_usbb_uecon3set_t;



typedef struct avr32_usbb_uecon4set_t {
    unsigned int                 :12;
    unsigned int stallrqs        : 1;
    unsigned int rstdts          : 1;
    unsigned int nyetdiss        : 1;
    unsigned int epdishdmas      : 1;
    unsigned int                 : 2;
    unsigned int killbks         : 1;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 1;
    unsigned int errortranses    : 1;
    unsigned int dataxes         : 1;
    unsigned int mdataes         : 1;
    unsigned int shortpacketes   : 1;
    unsigned int stalledes       : 1;
    unsigned int overfes         : 1;
    unsigned int nakines         : 1;
    unsigned int nakoutes        : 1;
    unsigned int rxstpes         : 1;
    unsigned int rxoutes         : 1;
    unsigned int txines          : 1;
} avr32_usbb_uecon4set_t;



typedef struct avr32_usbb_uecon5set_t {
    unsigned int                 :12;
    unsigned int stallrqs        : 1;
    unsigned int rstdts          : 1;
    unsigned int nyetdiss        : 1;
    unsigned int epdishdmas      : 1;
    unsigned int                 : 2;
    unsigned int killbks         : 1;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 1;
    unsigned int errortranses    : 1;
    unsigned int dataxes         : 1;
    unsigned int mdataes         : 1;
    unsigned int shortpacketes   : 1;
    unsigned int stalledes       : 1;
    unsigned int overfes         : 1;
    unsigned int nakines         : 1;
    unsigned int nakoutes        : 1;
    unsigned int rxstpes         : 1;
    unsigned int rxoutes         : 1;
    unsigned int txines          : 1;
} avr32_usbb_uecon5set_t;



typedef struct avr32_usbb_uecon6set_t {
    unsigned int                 :12;
    unsigned int stallrqs        : 1;
    unsigned int rstdts          : 1;
    unsigned int nyetdiss        : 1;
    unsigned int epdishdmas      : 1;
    unsigned int                 : 2;
    unsigned int killbks         : 1;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 1;
    unsigned int errortranses    : 1;
    unsigned int dataxes         : 1;
    unsigned int mdataes         : 1;
    unsigned int shortpacketes   : 1;
    unsigned int stalledes       : 1;
    unsigned int overfes         : 1;
    unsigned int nakines         : 1;
    unsigned int nakoutes        : 1;
    unsigned int rxstpes         : 1;
    unsigned int rxoutes         : 1;
    unsigned int txines          : 1;
} avr32_usbb_uecon6set_t;



typedef struct avr32_usbb_uecon0clr_t {
    unsigned int                 :12;
    unsigned int stallrqc        : 1;
    unsigned int                 : 1;
    unsigned int nyetdisc        : 1;
    unsigned int epdishdmac      : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 1;
    unsigned int errortransec    : 1;
    unsigned int dataxec         : 1;
    unsigned int mdataec         : 1;
    unsigned int shortpacketec   : 1;
    unsigned int stalledec       : 1;
    unsigned int overfec         : 1;
    unsigned int nakinec         : 1;
    unsigned int nakoutec        : 1;
    unsigned int rxstpec         : 1;
    unsigned int rxoutec         : 1;
    unsigned int txinec          : 1;
} avr32_usbb_uecon0clr_t;



typedef struct avr32_usbb_uecon1clr_t {
    unsigned int                 :12;
    unsigned int stallrqc        : 1;
    unsigned int                 : 1;
    unsigned int nyetdisc        : 1;
    unsigned int epdishdmac      : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 1;
    unsigned int errortransec    : 1;
    unsigned int dataxec         : 1;
    unsigned int mdataec         : 1;
    unsigned int shortpacketec   : 1;
    unsigned int stalledec       : 1;
    unsigned int overfec         : 1;
    unsigned int nakinec         : 1;
    unsigned int nakoutec        : 1;
    unsigned int rxstpec         : 1;
    unsigned int rxoutec         : 1;
    unsigned int txinec          : 1;
} avr32_usbb_uecon1clr_t;



typedef struct avr32_usbb_uecon2clr_t {
    unsigned int                 :12;
    unsigned int stallrqc        : 1;
    unsigned int                 : 1;
    unsigned int nyetdisc        : 1;
    unsigned int epdishdmac      : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 1;
    unsigned int errortransec    : 1;
    unsigned int dataxec         : 1;
    unsigned int mdataec         : 1;
    unsigned int shortpacketec   : 1;
    unsigned int stalledec       : 1;
    unsigned int overfec         : 1;
    unsigned int nakinec         : 1;
    unsigned int nakoutec        : 1;
    unsigned int rxstpec         : 1;
    unsigned int rxoutec         : 1;
    unsigned int txinec          : 1;
} avr32_usbb_uecon2clr_t;



typedef struct avr32_usbb_uecon3clr_t {
    unsigned int                 :12;
    unsigned int stallrqc        : 1;
    unsigned int                 : 1;
    unsigned int nyetdisc        : 1;
    unsigned int epdishdmac      : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 1;
    unsigned int errortransec    : 1;
    unsigned int dataxec         : 1;
    unsigned int mdataec         : 1;
    unsigned int shortpacketec   : 1;
    unsigned int stalledec       : 1;
    unsigned int overfec         : 1;
    unsigned int nakinec         : 1;
    unsigned int nakoutec        : 1;
    unsigned int rxstpec         : 1;
    unsigned int rxoutec         : 1;
    unsigned int txinec          : 1;
} avr32_usbb_uecon3clr_t;



typedef struct avr32_usbb_uecon4clr_t {
    unsigned int                 :12;
    unsigned int stallrqc        : 1;
    unsigned int                 : 1;
    unsigned int nyetdisc        : 1;
    unsigned int epdishdmac      : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 1;
    unsigned int errortransec    : 1;
    unsigned int dataxec         : 1;
    unsigned int mdataec         : 1;
    unsigned int shortpacketec   : 1;
    unsigned int stalledec       : 1;
    unsigned int overfec         : 1;
    unsigned int nakinec         : 1;
    unsigned int nakoutec        : 1;
    unsigned int rxstpec         : 1;
    unsigned int rxoutec         : 1;
    unsigned int txinec          : 1;
} avr32_usbb_uecon4clr_t;



typedef struct avr32_usbb_uecon5clr_t {
    unsigned int                 :12;
    unsigned int stallrqc        : 1;
    unsigned int                 : 1;
    unsigned int nyetdisc        : 1;
    unsigned int epdishdmac      : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 1;
    unsigned int errortransec    : 1;
    unsigned int dataxec         : 1;
    unsigned int mdataec         : 1;
    unsigned int shortpacketec   : 1;
    unsigned int stalledec       : 1;
    unsigned int overfec         : 1;
    unsigned int nakinec         : 1;
    unsigned int nakoutec        : 1;
    unsigned int rxstpec         : 1;
    unsigned int rxoutec         : 1;
    unsigned int txinec          : 1;
} avr32_usbb_uecon5clr_t;



typedef struct avr32_usbb_uecon6clr_t {
    unsigned int                 :12;
    unsigned int stallrqc        : 1;
    unsigned int                 : 1;
    unsigned int nyetdisc        : 1;
    unsigned int epdishdmac      : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 1;
    unsigned int errortransec    : 1;
    unsigned int dataxec         : 1;
    unsigned int mdataec         : 1;
    unsigned int shortpacketec   : 1;
    unsigned int stalledec       : 1;
    unsigned int overfec         : 1;
    unsigned int nakinec         : 1;
    unsigned int nakoutec        : 1;
    unsigned int rxstpec         : 1;
    unsigned int rxoutec         : 1;
    unsigned int txinec          : 1;
} avr32_usbb_uecon6clr_t;



typedef struct avr32_usbb_uddma1_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uddma1_nextdesc_t;



typedef struct avr32_usbb_uddma1_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma1_control_t;



typedef struct avr32_usbb_uddma1_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma1_status_t;



typedef struct avr32_usbb_uddma2_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uddma2_nextdesc_t;



typedef struct avr32_usbb_uddma2_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma2_control_t;



typedef struct avr32_usbb_uddma2_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma2_status_t;



typedef struct avr32_usbb_uddma3_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uddma3_nextdesc_t;



typedef struct avr32_usbb_uddma3_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma3_control_t;



typedef struct avr32_usbb_uddma3_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma3_status_t;



typedef struct avr32_usbb_uddma4_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uddma4_nextdesc_t;



typedef struct avr32_usbb_uddma4_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma4_control_t;



typedef struct avr32_usbb_uddma4_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma4_status_t;



typedef struct avr32_usbb_uddma5_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uddma5_nextdesc_t;



typedef struct avr32_usbb_uddma5_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma5_control_t;



typedef struct avr32_usbb_uddma5_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma5_status_t;



typedef struct avr32_usbb_uddma6_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uddma6_nextdesc_t;



typedef struct avr32_usbb_uddma6_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma6_control_t;



typedef struct avr32_usbb_uddma6_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uddma6_status_t;



typedef struct avr32_usbb_uhcon_t {
    unsigned int                 :18;
    unsigned int spdconf         : 2;
    unsigned int                 : 1;
    unsigned int resume          : 1;
    unsigned int reset           : 1;
    unsigned int sofe            : 1;
    unsigned int                 : 8;
} avr32_usbb_uhcon_t;



typedef struct avr32_usbb_uhint_t {
    unsigned int                 : 1;
    unsigned int dma6int         : 1;
    unsigned int dma5int         : 1;
    unsigned int dma4int         : 1;
    unsigned int dma3int         : 1;
    unsigned int dma2int         : 1;
    unsigned int dma1int         : 1;
    unsigned int                 :10;
    unsigned int p6int           : 1;
    unsigned int p5int           : 1;
    unsigned int p4int           : 1;
    unsigned int p3int           : 1;
    unsigned int p2int           : 1;
    unsigned int p1int           : 1;
    unsigned int p0int           : 1;
    unsigned int                 : 1;
    unsigned int hwupi           : 1;
    unsigned int hsofi           : 1;
    unsigned int rxrsmi          : 1;
    unsigned int rsmedi          : 1;
    unsigned int rsti            : 1;
    unsigned int ddisci          : 1;
    unsigned int dconni          : 1;
} avr32_usbb_uhint_t;



typedef struct avr32_usbb_uhintclr_t {
    unsigned int                 :25;
    unsigned int hwupic          : 1;
    unsigned int hsofic          : 1;
    unsigned int rxrsmic         : 1;
    unsigned int rsmedic         : 1;
    unsigned int rstic           : 1;
    unsigned int ddiscic         : 1;
    unsigned int dconnic         : 1;
} avr32_usbb_uhintclr_t;



typedef struct avr32_usbb_uhintset_t {
    unsigned int                 : 1;
    unsigned int dma6ints        : 1;
    unsigned int dma5ints        : 1;
    unsigned int dma4ints        : 1;
    unsigned int dma3ints        : 1;
    unsigned int dma2ints        : 1;
    unsigned int dma1ints        : 1;
    unsigned int                 :18;
    unsigned int hwupis          : 1;
    unsigned int hsofis          : 1;
    unsigned int rxrsmis         : 1;
    unsigned int rsmedis         : 1;
    unsigned int rstis           : 1;
    unsigned int ddiscis         : 1;
    unsigned int dconnis         : 1;
} avr32_usbb_uhintset_t;



typedef struct avr32_usbb_uhinte_t {
    unsigned int                 : 1;
    unsigned int dma6inte        : 1;
    unsigned int dma5inte        : 1;
    unsigned int dma4inte        : 1;
    unsigned int dma3inte        : 1;
    unsigned int dma2inte        : 1;
    unsigned int dma1inte        : 1;
    unsigned int                 :10;
    unsigned int p6inte          : 1;
    unsigned int p5inte          : 1;
    unsigned int p4inte          : 1;
    unsigned int p3inte          : 1;
    unsigned int p2inte          : 1;
    unsigned int p1inte          : 1;
    unsigned int p0inte          : 1;
    unsigned int                 : 1;
    unsigned int hwupie          : 1;
    unsigned int hsofie          : 1;
    unsigned int rxrsmie         : 1;
    unsigned int rsmedie         : 1;
    unsigned int rstie           : 1;
    unsigned int ddiscie         : 1;
    unsigned int dconnie         : 1;
} avr32_usbb_uhinte_t;



typedef struct avr32_usbb_uhinteclr_t {
    unsigned int                 : 1;
    unsigned int dma6intec       : 1;
    unsigned int dma5intec       : 1;
    unsigned int dma4intec       : 1;
    unsigned int dma3intec       : 1;
    unsigned int dma2intec       : 1;
    unsigned int dma1intec       : 1;
    unsigned int                 :10;
    unsigned int p6intec         : 1;
    unsigned int p5intec         : 1;
    unsigned int p4intec         : 1;
    unsigned int p3intec         : 1;
    unsigned int p2intec         : 1;
    unsigned int p1intec         : 1;
    unsigned int p0intec         : 1;
    unsigned int                 : 1;
    unsigned int hwupiec         : 1;
    unsigned int hsofiec         : 1;
    unsigned int rxrsmiec        : 1;
    unsigned int rsmediec        : 1;
    unsigned int rstiec          : 1;
    unsigned int ddisciec        : 1;
    unsigned int dconniec        : 1;
} avr32_usbb_uhinteclr_t;



typedef struct avr32_usbb_uhinteset_t {
    unsigned int                 : 1;
    unsigned int dma6intes       : 1;
    unsigned int dma5intes       : 1;
    unsigned int dma4intes       : 1;
    unsigned int dma3intes       : 1;
    unsigned int dma2intes       : 1;
    unsigned int dma1intes       : 1;
    unsigned int                 :10;
    unsigned int p6intes         : 1;
    unsigned int p5intes         : 1;
    unsigned int p4intes         : 1;
    unsigned int p3intes         : 1;
    unsigned int p2intes         : 1;
    unsigned int p1intes         : 1;
    unsigned int p0intes         : 1;
    unsigned int                 : 1;
    unsigned int hwupies         : 1;
    unsigned int hsofies         : 1;
    unsigned int rxrsmies        : 1;
    unsigned int rsmedies        : 1;
    unsigned int rsties          : 1;
    unsigned int ddiscies        : 1;
    unsigned int dconnies        : 1;
} avr32_usbb_uhinteset_t;



typedef struct avr32_usbb_uprst_t {
    unsigned int                 : 9;
    unsigned int prst6           : 1;
    unsigned int prst5           : 1;
    unsigned int prst4           : 1;
    unsigned int prst3           : 1;
    unsigned int prst2           : 1;
    unsigned int prst1           : 1;
    unsigned int prst0           : 1;
    unsigned int                 : 9;
    unsigned int pen6            : 1;
    unsigned int pen5            : 1;
    unsigned int pen4            : 1;
    unsigned int pen3            : 1;
    unsigned int pen2            : 1;
    unsigned int pen1            : 1;
    unsigned int pen0            : 1;
} avr32_usbb_uprst_t;



typedef struct avr32_usbb_uhfnum_t {
    unsigned int                 : 8;
    unsigned int flenhigh        : 8;
    unsigned int                 : 2;
    unsigned int fnum            :11;
    unsigned int mfnum           : 3;
} avr32_usbb_uhfnum_t;



typedef struct avr32_usbb_uhaddr1_t {
    unsigned int                 : 1;
    unsigned int uhaddr_p3       : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p2       : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p1       : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p0       : 7;
} avr32_usbb_uhaddr1_t;



typedef struct avr32_usbb_uhaddr2_t {
    unsigned int                 : 1;
    unsigned int uhaddr_p7       : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p6       : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p5       : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p4       : 7;
} avr32_usbb_uhaddr2_t;



typedef struct avr32_usbb_uhaddr3_t {
    unsigned int                 : 1;
    unsigned int uhaddr_p11      : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p10      : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p9       : 7;
    unsigned int                 : 1;
    unsigned int uhaddr_p8       : 7;
} avr32_usbb_uhaddr3_t;



typedef struct avr32_usbb_upcfg0_t {
    unsigned int intfrq          : 8;
    unsigned int datasizerdwr    : 2;
    unsigned int                 : 1;
    unsigned int pingen          : 1;
    unsigned int pepnum          : 4;
    unsigned int                 : 2;
    unsigned int ptype           : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int ptoken          : 2;
    unsigned int                 : 1;
    unsigned int psize           : 3;
    unsigned int pbk             : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_upcfg0_t;



typedef struct avr32_usbb_upcfg1_t {
    unsigned int intfrq          : 8;
    unsigned int datasizerdwr    : 2;
    unsigned int                 : 1;
    unsigned int pingen          : 1;
    unsigned int pepnum          : 4;
    unsigned int                 : 2;
    unsigned int ptype           : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int ptoken          : 2;
    unsigned int                 : 1;
    unsigned int psize           : 3;
    unsigned int pbk             : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_upcfg1_t;



typedef struct avr32_usbb_upcfg2_t {
    unsigned int intfrq          : 8;
    unsigned int datasizerdwr    : 2;
    unsigned int                 : 1;
    unsigned int pingen          : 1;
    unsigned int pepnum          : 4;
    unsigned int                 : 2;
    unsigned int ptype           : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int ptoken          : 2;
    unsigned int                 : 1;
    unsigned int psize           : 3;
    unsigned int pbk             : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_upcfg2_t;



typedef struct avr32_usbb_upcfg3_t {
    unsigned int intfrq          : 8;
    unsigned int datasizerdwr    : 2;
    unsigned int                 : 1;
    unsigned int pingen          : 1;
    unsigned int pepnum          : 4;
    unsigned int                 : 2;
    unsigned int ptype           : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int ptoken          : 2;
    unsigned int                 : 1;
    unsigned int psize           : 3;
    unsigned int pbk             : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_upcfg3_t;



typedef struct avr32_usbb_upcfg4_t {
    unsigned int intfrq          : 8;
    unsigned int datasizerdwr    : 2;
    unsigned int                 : 1;
    unsigned int pingen          : 1;
    unsigned int pepnum          : 4;
    unsigned int                 : 2;
    unsigned int ptype           : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int ptoken          : 2;
    unsigned int                 : 1;
    unsigned int psize           : 3;
    unsigned int pbk             : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_upcfg4_t;



typedef struct avr32_usbb_upcfg5_t {
    unsigned int intfrq          : 8;
    unsigned int datasizerdwr    : 2;
    unsigned int                 : 1;
    unsigned int pingen          : 1;
    unsigned int pepnum          : 4;
    unsigned int                 : 2;
    unsigned int ptype           : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int ptoken          : 2;
    unsigned int                 : 1;
    unsigned int psize           : 3;
    unsigned int pbk             : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_upcfg5_t;



typedef struct avr32_usbb_upcfg6_t {
    unsigned int intfrq          : 8;
    unsigned int datasizerdwr    : 2;
    unsigned int                 : 1;
    unsigned int pingen          : 1;
    unsigned int pepnum          : 4;
    unsigned int                 : 2;
    unsigned int ptype           : 2;
    unsigned int                 : 1;
    unsigned int autosw          : 1;
    unsigned int ptoken          : 2;
    unsigned int                 : 1;
    unsigned int psize           : 3;
    unsigned int pbk             : 2;
    unsigned int alloc           : 1;
    unsigned int                 : 1;
} avr32_usbb_upcfg6_t;



typedef struct avr32_usbb_upsta0_t {
    unsigned int                 : 1;
    unsigned int pbyct           :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int                 : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 2;
    unsigned int dtseq           : 2;
    unsigned int shortpacketi    : 1;
    unsigned int rxstalldi       : 1;
    unsigned int overfi          : 1;
    unsigned int nakedi          : 1;
    unsigned int perri           : 1;
    unsigned int txstpi          : 1;
    unsigned int txouti          : 1;
    unsigned int rxini           : 1;
} avr32_usbb_upsta0_t;



typedef struct avr32_usbb_upsta1_t {
    unsigned int                 : 1;
    unsigned int pbyct           :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int                 : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 2;
    unsigned int dtseq           : 2;
    unsigned int shortpacketi    : 1;
    unsigned int rxstalldi       : 1;
    unsigned int overfi          : 1;
    unsigned int nakedi          : 1;
    unsigned int perri           : 1;
    unsigned int txstpi          : 1;
    unsigned int txouti          : 1;
    unsigned int rxini           : 1;
} avr32_usbb_upsta1_t;



typedef struct avr32_usbb_upsta2_t {
    unsigned int                 : 1;
    unsigned int pbyct           :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int                 : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 2;
    unsigned int dtseq           : 2;
    unsigned int shortpacketi    : 1;
    unsigned int rxstalldi       : 1;
    unsigned int overfi          : 1;
    unsigned int nakedi          : 1;
    unsigned int perri           : 1;
    unsigned int txstpi          : 1;
    unsigned int txouti          : 1;
    unsigned int rxini           : 1;
} avr32_usbb_upsta2_t;



typedef struct avr32_usbb_upsta3_t {
    unsigned int                 : 1;
    unsigned int pbyct           :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int                 : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 2;
    unsigned int dtseq           : 2;
    unsigned int shortpacketi    : 1;
    unsigned int rxstalldi       : 1;
    unsigned int overfi          : 1;
    unsigned int nakedi          : 1;
    unsigned int perri           : 1;
    unsigned int txstpi          : 1;
    unsigned int txouti          : 1;
    unsigned int rxini           : 1;
} avr32_usbb_upsta3_t;



typedef struct avr32_usbb_upsta4_t {
    unsigned int                 : 1;
    unsigned int pbyct           :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int                 : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 2;
    unsigned int dtseq           : 2;
    unsigned int shortpacketi    : 1;
    unsigned int rxstalldi       : 1;
    unsigned int overfi          : 1;
    unsigned int nakedi          : 1;
    unsigned int perri           : 1;
    unsigned int txstpi          : 1;
    unsigned int txouti          : 1;
    unsigned int rxini           : 1;
} avr32_usbb_upsta4_t;



typedef struct avr32_usbb_upsta5_t {
    unsigned int                 : 1;
    unsigned int pbyct           :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int                 : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 2;
    unsigned int dtseq           : 2;
    unsigned int shortpacketi    : 1;
    unsigned int rxstalldi       : 1;
    unsigned int overfi          : 1;
    unsigned int nakedi          : 1;
    unsigned int perri           : 1;
    unsigned int txstpi          : 1;
    unsigned int txouti          : 1;
    unsigned int rxini           : 1;
} avr32_usbb_upsta5_t;



typedef struct avr32_usbb_upsta6_t {
    unsigned int                 : 1;
    unsigned int pbyct           :11;
    unsigned int                 : 1;
    unsigned int cfgok           : 1;
    unsigned int                 : 1;
    unsigned int rwall           : 1;
    unsigned int currbk          : 2;
    unsigned int nbusybk         : 2;
    unsigned int                 : 2;
    unsigned int dtseq           : 2;
    unsigned int shortpacketi    : 1;
    unsigned int rxstalldi       : 1;
    unsigned int overfi          : 1;
    unsigned int nakedi          : 1;
    unsigned int perri           : 1;
    unsigned int txstpi          : 1;
    unsigned int txouti          : 1;
    unsigned int rxini           : 1;
} avr32_usbb_upsta6_t;



typedef struct avr32_usbb_upsta0clr_t {
    unsigned int                 :24;
    unsigned int shortpacketic   : 1;
    unsigned int rxstalldic      : 1;
    unsigned int overfic         : 1;
    unsigned int nakedic         : 1;
    unsigned int                 : 1;
    unsigned int txstpic         : 1;
    unsigned int txoutic         : 1;
    unsigned int rxinic          : 1;
} avr32_usbb_upsta0clr_t;



typedef struct avr32_usbb_upsta1clr_t {
    unsigned int                 :24;
    unsigned int shortpacketic   : 1;
    unsigned int rxstalldic      : 1;
    unsigned int overfic         : 1;
    unsigned int nakedic         : 1;
    unsigned int                 : 1;
    unsigned int txstpic         : 1;
    unsigned int txoutic         : 1;
    unsigned int rxinic          : 1;
} avr32_usbb_upsta1clr_t;



typedef struct avr32_usbb_upsta2clr_t {
    unsigned int                 :24;
    unsigned int shortpacketic   : 1;
    unsigned int rxstalldic      : 1;
    unsigned int overfic         : 1;
    unsigned int nakedic         : 1;
    unsigned int                 : 1;
    unsigned int txstpic         : 1;
    unsigned int txoutic         : 1;
    unsigned int rxinic          : 1;
} avr32_usbb_upsta2clr_t;



typedef struct avr32_usbb_upsta3clr_t {
    unsigned int                 :24;
    unsigned int shortpacketic   : 1;
    unsigned int rxstalldic      : 1;
    unsigned int overfic         : 1;
    unsigned int nakedic         : 1;
    unsigned int                 : 1;
    unsigned int txstpic         : 1;
    unsigned int txoutic         : 1;
    unsigned int rxinic          : 1;
} avr32_usbb_upsta3clr_t;



typedef struct avr32_usbb_upsta4clr_t {
    unsigned int                 :24;
    unsigned int shortpacketic   : 1;
    unsigned int rxstalldic      : 1;
    unsigned int overfic         : 1;
    unsigned int nakedic         : 1;
    unsigned int                 : 1;
    unsigned int txstpic         : 1;
    unsigned int txoutic         : 1;
    unsigned int rxinic          : 1;
} avr32_usbb_upsta4clr_t;



typedef struct avr32_usbb_upsta5clr_t {
    unsigned int                 :24;
    unsigned int shortpacketic   : 1;
    unsigned int rxstalldic      : 1;
    unsigned int overfic         : 1;
    unsigned int nakedic         : 1;
    unsigned int                 : 1;
    unsigned int txstpic         : 1;
    unsigned int txoutic         : 1;
    unsigned int rxinic          : 1;
} avr32_usbb_upsta5clr_t;



typedef struct avr32_usbb_upsta6clr_t {
    unsigned int                 :24;
    unsigned int shortpacketic   : 1;
    unsigned int rxstalldic      : 1;
    unsigned int overfic         : 1;
    unsigned int nakedic         : 1;
    unsigned int                 : 1;
    unsigned int txstpic         : 1;
    unsigned int txoutic         : 1;
    unsigned int rxinic          : 1;
} avr32_usbb_upsta6clr_t;



typedef struct avr32_usbb_upsta0set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketis   : 1;
    unsigned int rxstalldis      : 1;
    unsigned int overfis         : 1;
    unsigned int nakedis         : 1;
    unsigned int perris          : 1;
    unsigned int txstpis         : 1;
    unsigned int txoutis         : 1;
    unsigned int rxinis          : 1;
} avr32_usbb_upsta0set_t;



typedef struct avr32_usbb_upsta1set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketis   : 1;
    unsigned int rxstalldis      : 1;
    unsigned int overfis         : 1;
    unsigned int nakedis         : 1;
    unsigned int perris          : 1;
    unsigned int txstpis         : 1;
    unsigned int txoutis         : 1;
    unsigned int rxinis          : 1;
} avr32_usbb_upsta1set_t;



typedef struct avr32_usbb_upsta2set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketis   : 1;
    unsigned int rxstalldis      : 1;
    unsigned int overfis         : 1;
    unsigned int nakedis         : 1;
    unsigned int perris          : 1;
    unsigned int txstpis         : 1;
    unsigned int txoutis         : 1;
    unsigned int rxinis          : 1;
} avr32_usbb_upsta2set_t;



typedef struct avr32_usbb_upsta3set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketis   : 1;
    unsigned int rxstalldis      : 1;
    unsigned int overfis         : 1;
    unsigned int nakedis         : 1;
    unsigned int perris          : 1;
    unsigned int txstpis         : 1;
    unsigned int txoutis         : 1;
    unsigned int rxinis          : 1;
} avr32_usbb_upsta3set_t;



typedef struct avr32_usbb_upsta4set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketis   : 1;
    unsigned int rxstalldis      : 1;
    unsigned int overfis         : 1;
    unsigned int nakedis         : 1;
    unsigned int perris          : 1;
    unsigned int txstpis         : 1;
    unsigned int txoutis         : 1;
    unsigned int rxinis          : 1;
} avr32_usbb_upsta4set_t;



typedef struct avr32_usbb_upsta5set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketis   : 1;
    unsigned int rxstalldis      : 1;
    unsigned int overfis         : 1;
    unsigned int nakedis         : 1;
    unsigned int perris          : 1;
    unsigned int txstpis         : 1;
    unsigned int txoutis         : 1;
    unsigned int rxinis          : 1;
} avr32_usbb_upsta5set_t;



typedef struct avr32_usbb_upsta6set_t {
    unsigned int                 :19;
    unsigned int nbusybks        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketis   : 1;
    unsigned int rxstalldis      : 1;
    unsigned int overfis         : 1;
    unsigned int nakedis         : 1;
    unsigned int perris          : 1;
    unsigned int txstpis         : 1;
    unsigned int txoutis         : 1;
    unsigned int rxinis          : 1;
} avr32_usbb_upsta6set_t;



typedef struct avr32_usbb_upcon0_t {
    unsigned int                 :13;
    unsigned int rstdt           : 1;
    unsigned int pfreeze         : 1;
    unsigned int pdishdma        : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int                 : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketie   : 1;
    unsigned int rxstallde       : 1;
    unsigned int overfie         : 1;
    unsigned int nakede          : 1;
    unsigned int perre           : 1;
    unsigned int txstpe          : 1;
    unsigned int txoute          : 1;
    unsigned int rxine           : 1;
} avr32_usbb_upcon0_t;



typedef struct avr32_usbb_upcon1_t {
    unsigned int                 :13;
    unsigned int rstdt           : 1;
    unsigned int pfreeze         : 1;
    unsigned int pdishdma        : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int                 : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketie   : 1;
    unsigned int rxstallde       : 1;
    unsigned int overfie         : 1;
    unsigned int nakede          : 1;
    unsigned int perre           : 1;
    unsigned int txstpe          : 1;
    unsigned int txoute          : 1;
    unsigned int rxine           : 1;
} avr32_usbb_upcon1_t;



typedef struct avr32_usbb_upcon2_t {
    unsigned int                 :13;
    unsigned int rstdt           : 1;
    unsigned int pfreeze         : 1;
    unsigned int pdishdma        : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int                 : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketie   : 1;
    unsigned int rxstallde       : 1;
    unsigned int overfie         : 1;
    unsigned int nakede          : 1;
    unsigned int perre           : 1;
    unsigned int txstpe          : 1;
    unsigned int txoute          : 1;
    unsigned int rxine           : 1;
} avr32_usbb_upcon2_t;



typedef struct avr32_usbb_upcon3_t {
    unsigned int                 :13;
    unsigned int rstdt           : 1;
    unsigned int pfreeze         : 1;
    unsigned int pdishdma        : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int                 : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketie   : 1;
    unsigned int rxstallde       : 1;
    unsigned int overfie         : 1;
    unsigned int nakede          : 1;
    unsigned int perre           : 1;
    unsigned int txstpe          : 1;
    unsigned int txoute          : 1;
    unsigned int rxine           : 1;
} avr32_usbb_upcon3_t;



typedef struct avr32_usbb_upcon4_t {
    unsigned int                 :13;
    unsigned int rstdt           : 1;
    unsigned int pfreeze         : 1;
    unsigned int pdishdma        : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int                 : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketie   : 1;
    unsigned int rxstallde       : 1;
    unsigned int overfie         : 1;
    unsigned int nakede          : 1;
    unsigned int perre           : 1;
    unsigned int txstpe          : 1;
    unsigned int txoute          : 1;
    unsigned int rxine           : 1;
} avr32_usbb_upcon4_t;



typedef struct avr32_usbb_upcon5_t {
    unsigned int                 :13;
    unsigned int rstdt           : 1;
    unsigned int pfreeze         : 1;
    unsigned int pdishdma        : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int                 : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketie   : 1;
    unsigned int rxstallde       : 1;
    unsigned int overfie         : 1;
    unsigned int nakede          : 1;
    unsigned int perre           : 1;
    unsigned int txstpe          : 1;
    unsigned int txoute          : 1;
    unsigned int rxine           : 1;
} avr32_usbb_upcon5_t;



typedef struct avr32_usbb_upcon6_t {
    unsigned int                 :13;
    unsigned int rstdt           : 1;
    unsigned int pfreeze         : 1;
    unsigned int pdishdma        : 1;
    unsigned int                 : 1;
    unsigned int fifocon         : 1;
    unsigned int                 : 1;
    unsigned int nbusybke        : 1;
    unsigned int                 : 4;
    unsigned int shortpacketie   : 1;
    unsigned int rxstallde       : 1;
    unsigned int overfie         : 1;
    unsigned int nakede          : 1;
    unsigned int perre           : 1;
    unsigned int txstpe          : 1;
    unsigned int txoute          : 1;
    unsigned int rxine           : 1;
} avr32_usbb_upcon6_t;



typedef struct avr32_usbb_upcon0set_t {
    unsigned int                 :13;
    unsigned int rstdts          : 1;
    unsigned int pfreezes        : 1;
    unsigned int pdishdmas       : 1;
    unsigned int                 : 3;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketies  : 1;
    unsigned int rxstalldes      : 1;
    unsigned int overfies        : 1;
    unsigned int nakedes         : 1;
    unsigned int perres          : 1;
    unsigned int txstpes         : 1;
    unsigned int txoutes         : 1;
    unsigned int rxines          : 1;
} avr32_usbb_upcon0set_t;



typedef struct avr32_usbb_upcon1set_t {
    unsigned int                 :13;
    unsigned int rstdts          : 1;
    unsigned int pfreezes        : 1;
    unsigned int pdishdmas       : 1;
    unsigned int                 : 3;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketies  : 1;
    unsigned int rxstalldes      : 1;
    unsigned int overfies        : 1;
    unsigned int nakedes         : 1;
    unsigned int perres          : 1;
    unsigned int txstpes         : 1;
    unsigned int txoutes         : 1;
    unsigned int rxines          : 1;
} avr32_usbb_upcon1set_t;



typedef struct avr32_usbb_upcon2set_t {
    unsigned int                 :13;
    unsigned int rstdts          : 1;
    unsigned int pfreezes        : 1;
    unsigned int pdishdmas       : 1;
    unsigned int                 : 3;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketies  : 1;
    unsigned int rxstalldes      : 1;
    unsigned int overfies        : 1;
    unsigned int nakedes         : 1;
    unsigned int perres          : 1;
    unsigned int txstpes         : 1;
    unsigned int txoutes         : 1;
    unsigned int rxines          : 1;
} avr32_usbb_upcon2set_t;



typedef struct avr32_usbb_upcon3set_t {
    unsigned int                 :13;
    unsigned int rstdts          : 1;
    unsigned int pfreezes        : 1;
    unsigned int pdishdmas       : 1;
    unsigned int                 : 3;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketies  : 1;
    unsigned int rxstalldes      : 1;
    unsigned int overfies        : 1;
    unsigned int nakedes         : 1;
    unsigned int perres          : 1;
    unsigned int txstpes         : 1;
    unsigned int txoutes         : 1;
    unsigned int rxines          : 1;
} avr32_usbb_upcon3set_t;



typedef struct avr32_usbb_upcon4set_t {
    unsigned int                 :13;
    unsigned int rstdts          : 1;
    unsigned int pfreezes        : 1;
    unsigned int pdishdmas       : 1;
    unsigned int                 : 3;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketies  : 1;
    unsigned int rxstalldes      : 1;
    unsigned int overfies        : 1;
    unsigned int nakedes         : 1;
    unsigned int perres          : 1;
    unsigned int txstpes         : 1;
    unsigned int txoutes         : 1;
    unsigned int rxines          : 1;
} avr32_usbb_upcon4set_t;



typedef struct avr32_usbb_upcon5set_t {
    unsigned int                 :13;
    unsigned int rstdts          : 1;
    unsigned int pfreezes        : 1;
    unsigned int pdishdmas       : 1;
    unsigned int                 : 3;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketies  : 1;
    unsigned int rxstalldes      : 1;
    unsigned int overfies        : 1;
    unsigned int nakedes         : 1;
    unsigned int perres          : 1;
    unsigned int txstpes         : 1;
    unsigned int txoutes         : 1;
    unsigned int rxines          : 1;
} avr32_usbb_upcon5set_t;



typedef struct avr32_usbb_upcon6set_t {
    unsigned int                 :13;
    unsigned int rstdts          : 1;
    unsigned int pfreezes        : 1;
    unsigned int pdishdmas       : 1;
    unsigned int                 : 3;
    unsigned int nbusybkes       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketies  : 1;
    unsigned int rxstalldes      : 1;
    unsigned int overfies        : 1;
    unsigned int nakedes         : 1;
    unsigned int perres          : 1;
    unsigned int txstpes         : 1;
    unsigned int txoutes         : 1;
    unsigned int rxines          : 1;
} avr32_usbb_upcon6set_t;



typedef struct avr32_usbb_upcon0clr_t {
    unsigned int                 :14;
    unsigned int pfreezec        : 1;
    unsigned int pdishdmac       : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketiec  : 1;
    unsigned int rxstalldec      : 1;
    unsigned int overfiec        : 1;
    unsigned int nakedec         : 1;
    unsigned int perrec          : 1;
    unsigned int txstpec         : 1;
    unsigned int txoutec         : 1;
    unsigned int rxinec          : 1;
} avr32_usbb_upcon0clr_t;



typedef struct avr32_usbb_upcon1clr_t {
    unsigned int                 :14;
    unsigned int pfreezec        : 1;
    unsigned int pdishdmac       : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketiec  : 1;
    unsigned int rxstalldec      : 1;
    unsigned int overfiec        : 1;
    unsigned int nakedec         : 1;
    unsigned int perrec          : 1;
    unsigned int txstpec         : 1;
    unsigned int txoutec         : 1;
    unsigned int rxinec          : 1;
} avr32_usbb_upcon1clr_t;



typedef struct avr32_usbb_upcon2clr_t {
    unsigned int                 :14;
    unsigned int pfreezec        : 1;
    unsigned int pdishdmac       : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketiec  : 1;
    unsigned int rxstalldec      : 1;
    unsigned int overfiec        : 1;
    unsigned int nakedec         : 1;
    unsigned int perrec          : 1;
    unsigned int txstpec         : 1;
    unsigned int txoutec         : 1;
    unsigned int rxinec          : 1;
} avr32_usbb_upcon2clr_t;



typedef struct avr32_usbb_upcon3clr_t {
    unsigned int                 :14;
    unsigned int pfreezec        : 1;
    unsigned int pdishdmac       : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketiec  : 1;
    unsigned int rxstalldec      : 1;
    unsigned int overfiec        : 1;
    unsigned int nakedec         : 1;
    unsigned int perrec          : 1;
    unsigned int txstpec         : 1;
    unsigned int txoutec         : 1;
    unsigned int rxinec          : 1;
} avr32_usbb_upcon3clr_t;



typedef struct avr32_usbb_upcon4clr_t {
    unsigned int                 :14;
    unsigned int pfreezec        : 1;
    unsigned int pdishdmac       : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketiec  : 1;
    unsigned int rxstalldec      : 1;
    unsigned int overfiec        : 1;
    unsigned int nakedec         : 1;
    unsigned int perrec          : 1;
    unsigned int txstpec         : 1;
    unsigned int txoutec         : 1;
    unsigned int rxinec          : 1;
} avr32_usbb_upcon4clr_t;



typedef struct avr32_usbb_upcon5clr_t {
    unsigned int                 :14;
    unsigned int pfreezec        : 1;
    unsigned int pdishdmac       : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketiec  : 1;
    unsigned int rxstalldec      : 1;
    unsigned int overfiec        : 1;
    unsigned int nakedec         : 1;
    unsigned int perrec          : 1;
    unsigned int txstpec         : 1;
    unsigned int txoutec         : 1;
    unsigned int rxinec          : 1;
} avr32_usbb_upcon5clr_t;



typedef struct avr32_usbb_upcon6clr_t {
    unsigned int                 :14;
    unsigned int pfreezec        : 1;
    unsigned int pdishdmac       : 1;
    unsigned int                 : 1;
    unsigned int fifoconc        : 1;
    unsigned int                 : 1;
    unsigned int nbusybkec       : 1;
    unsigned int                 : 4;
    unsigned int shortpacketiec  : 1;
    unsigned int rxstalldec      : 1;
    unsigned int overfiec        : 1;
    unsigned int nakedec         : 1;
    unsigned int perrec          : 1;
    unsigned int txstpec         : 1;
    unsigned int txoutec         : 1;
    unsigned int rxinec          : 1;
} avr32_usbb_upcon6clr_t;



typedef struct avr32_usbb_upinrq0_t {
    unsigned int                 :23;
    unsigned int inmode          : 1;
    unsigned int inrq            : 8;
} avr32_usbb_upinrq0_t;



typedef struct avr32_usbb_upinrq1_t {
    unsigned int                 :23;
    unsigned int inmode          : 1;
    unsigned int inrq            : 8;
} avr32_usbb_upinrq1_t;



typedef struct avr32_usbb_upinrq2_t {
    unsigned int                 :23;
    unsigned int inmode          : 1;
    unsigned int inrq            : 8;
} avr32_usbb_upinrq2_t;



typedef struct avr32_usbb_upinrq3_t {
    unsigned int                 :23;
    unsigned int inmode          : 1;
    unsigned int inrq            : 8;
} avr32_usbb_upinrq3_t;



typedef struct avr32_usbb_upinrq4_t {
    unsigned int                 :23;
    unsigned int inmode          : 1;
    unsigned int inrq            : 8;
} avr32_usbb_upinrq4_t;



typedef struct avr32_usbb_upinrq5_t {
    unsigned int                 :23;
    unsigned int inmode          : 1;
    unsigned int inrq            : 8;
} avr32_usbb_upinrq5_t;



typedef struct avr32_usbb_upinrq6_t {
    unsigned int                 :23;
    unsigned int inmode          : 1;
    unsigned int inrq            : 8;
} avr32_usbb_upinrq6_t;



typedef struct avr32_usbb_uperr0_t {
    unsigned int                 :25;
    unsigned int counter         : 2;
    unsigned int crc16           : 1;
    unsigned int timeout         : 1;
    unsigned int pid             : 1;
    unsigned int datapid         : 1;
    unsigned int datatgl         : 1;
} avr32_usbb_uperr0_t;



typedef struct avr32_usbb_uperr1_t {
    unsigned int                 :25;
    unsigned int counter         : 2;
    unsigned int crc16           : 1;
    unsigned int timeout         : 1;
    unsigned int pid             : 1;
    unsigned int datapid         : 1;
    unsigned int datatgl         : 1;
} avr32_usbb_uperr1_t;



typedef struct avr32_usbb_uperr2_t {
    unsigned int                 :25;
    unsigned int counter         : 2;
    unsigned int crc16           : 1;
    unsigned int timeout         : 1;
    unsigned int pid             : 1;
    unsigned int datapid         : 1;
    unsigned int datatgl         : 1;
} avr32_usbb_uperr2_t;



typedef struct avr32_usbb_uperr3_t {
    unsigned int                 :25;
    unsigned int counter         : 2;
    unsigned int crc16           : 1;
    unsigned int timeout         : 1;
    unsigned int pid             : 1;
    unsigned int datapid         : 1;
    unsigned int datatgl         : 1;
} avr32_usbb_uperr3_t;



typedef struct avr32_usbb_uperr4_t {
    unsigned int                 :25;
    unsigned int counter         : 2;
    unsigned int crc16           : 1;
    unsigned int timeout         : 1;
    unsigned int pid             : 1;
    unsigned int datapid         : 1;
    unsigned int datatgl         : 1;
} avr32_usbb_uperr4_t;



typedef struct avr32_usbb_uperr5_t {
    unsigned int                 :25;
    unsigned int counter         : 2;
    unsigned int crc16           : 1;
    unsigned int timeout         : 1;
    unsigned int pid             : 1;
    unsigned int datapid         : 1;
    unsigned int datatgl         : 1;
} avr32_usbb_uperr5_t;



typedef struct avr32_usbb_uperr6_t {
    unsigned int                 :25;
    unsigned int counter         : 2;
    unsigned int crc16           : 1;
    unsigned int timeout         : 1;
    unsigned int pid             : 1;
    unsigned int datapid         : 1;
    unsigned int datatgl         : 1;
} avr32_usbb_uperr6_t;



typedef struct avr32_usbb_uhdma1_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uhdma1_nextdesc_t;



typedef struct avr32_usbb_uhdma1_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma1_control_t;



typedef struct avr32_usbb_uhdma1_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma1_status_t;



typedef struct avr32_usbb_uhdma2_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uhdma2_nextdesc_t;



typedef struct avr32_usbb_uhdma2_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma2_control_t;



typedef struct avr32_usbb_uhdma2_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma2_status_t;



typedef struct avr32_usbb_uhdma3_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uhdma3_nextdesc_t;



typedef struct avr32_usbb_uhdma3_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma3_control_t;



typedef struct avr32_usbb_uhdma3_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma3_status_t;



typedef struct avr32_usbb_uhdma4_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uhdma4_nextdesc_t;



typedef struct avr32_usbb_uhdma4_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma4_control_t;



typedef struct avr32_usbb_uhdma4_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma4_status_t;



typedef struct avr32_usbb_uhdma5_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uhdma5_nextdesc_t;



typedef struct avr32_usbb_uhdma5_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma5_control_t;



typedef struct avr32_usbb_uhdma5_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma5_status_t;



typedef struct avr32_usbb_uhdma6_nextdesc_t {
    unsigned int nxt_desc_addr   :28;
    unsigned int                 : 4;
} avr32_usbb_uhdma6_nextdesc_t;



typedef struct avr32_usbb_uhdma6_control_t {
    unsigned int ch_byte_length  :16;
    unsigned int                 : 8;
    unsigned int burst_lock_en   : 1;
    unsigned int desc_ld_irq_en  : 1;
    unsigned int eobuff_irq_en   : 1;
    unsigned int eot_irq_en      : 1;
    unsigned int dmaend_en       : 1;
    unsigned int buff_close_in_en : 1;
    unsigned int ld_nxt_ch_desc_en : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma6_control_t;



typedef struct avr32_usbb_uhdma6_status_t {
    unsigned int ch_byte_cnt     :16;
    unsigned int                 : 9;
    unsigned int desc_ld_sta     : 1;
    unsigned int eoch_buff_sta   : 1;
    unsigned int eot_sta         : 1;
    unsigned int                 : 2;
    unsigned int ch_active       : 1;
    unsigned int ch_en           : 1;
} avr32_usbb_uhdma6_status_t;



typedef struct avr32_usbb_usbcon_t {
    unsigned int                 : 6;
    unsigned int uimod           : 1;
    unsigned int uide            : 1;
    unsigned int                 : 1;
    unsigned int unlock          : 1;
    unsigned int timpage         : 2;
    unsigned int                 : 2;
    unsigned int timvalue        : 2;
    unsigned int usbe            : 1;
    unsigned int frzclk          : 1;
    unsigned int vbuspo          : 1;
    unsigned int otgpade         : 1;
    unsigned int hnpreq          : 1;
    unsigned int srpreq          : 1;
    unsigned int srpsel          : 1;
    unsigned int vbushwc         : 1;
    unsigned int stoe            : 1;
    unsigned int hnperre         : 1;
    unsigned int roleexe         : 1;
    unsigned int bcerre          : 1;
    unsigned int vberre          : 1;
    unsigned int srpe            : 1;
    unsigned int vbuste          : 1;
    unsigned int idte            : 1;
} avr32_usbb_usbcon_t;



typedef struct avr32_usbb_usbsta_t {
    unsigned int                 :17;
    unsigned int clkusable       : 1;
    unsigned int speed           : 2;
    unsigned int vbus            : 1;
    unsigned int id              : 1;
    unsigned int vbusrq          : 1;
    unsigned int                 : 1;
    unsigned int stoi            : 1;
    unsigned int hnperri         : 1;
    unsigned int roleexi         : 1;
    unsigned int bcerri          : 1;
    unsigned int vberri          : 1;
    unsigned int srpi            : 1;
    unsigned int vbusti          : 1;
    unsigned int idti            : 1;
} avr32_usbb_usbsta_t;



typedef struct avr32_usbb_usbstaclr_t {
    unsigned int                 :22;
    unsigned int vbusrqc         : 1;
    unsigned int                 : 1;
    unsigned int stoic           : 1;
    unsigned int hnperric        : 1;
    unsigned int roleexic        : 1;
    unsigned int bcerric         : 1;
    unsigned int vberric         : 1;
    unsigned int srpic           : 1;
    unsigned int vbustic         : 1;
    unsigned int idtic           : 1;
} avr32_usbb_usbstaclr_t;



typedef struct avr32_usbb_usbstaset_t {
    unsigned int                 :22;
    unsigned int vbusrqs         : 1;
    unsigned int                 : 1;
    unsigned int stois           : 1;
    unsigned int hnperris        : 1;
    unsigned int roleexis        : 1;
    unsigned int bcerris         : 1;
    unsigned int vberris         : 1;
    unsigned int srpis           : 1;
    unsigned int vbustis         : 1;
    unsigned int idtis           : 1;
} avr32_usbb_usbstaset_t;



typedef struct avr32_usbb_uatst1_t {
    unsigned int loadsofcnt      : 1;
    unsigned int sofcntmax       : 7;
    unsigned int loadcntb        : 1;
    unsigned int                 : 1;
    unsigned int counterb        : 6;
    unsigned int loadcnta        : 1;
    unsigned int countera        :15;
} avr32_usbb_uatst1_t;



typedef struct avr32_usbb_uatst2_t {
    unsigned int                 :23;
    unsigned int utmireset       : 1;
    unsigned int forcehsresetto50ms : 1;
    unsigned int hosthsdisconnectdisable : 1;
    unsigned int bypassdpll      : 1;
    unsigned int forcesuspendmto1 : 1;
    unsigned int disbalegatedclock : 1;
    unsigned int loopbackmode    : 1;
    unsigned int hsserialmode    : 1;
    unsigned int fulldetachen    : 1;
} avr32_usbb_uatst2_t;



typedef struct avr32_usbb_uvers_t {
    unsigned int                 :13;
    unsigned int metal_fix_num   : 3;
    unsigned int version_num     :16;
} avr32_usbb_uvers_t;



typedef struct avr32_usbb_ufeatures_t {
    unsigned int en_high_bd_iso_ept_15 : 1;
    unsigned int en_high_bd_iso_ept_14 : 1;
    unsigned int en_high_bd_iso_ept_13 : 1;
    unsigned int en_high_bd_iso_ept_12 : 1;
    unsigned int en_high_bd_iso_ept_11 : 1;
    unsigned int en_high_bd_iso_ept_10 : 1;
    unsigned int en_high_bd_iso_ept_9 : 1;
    unsigned int en_high_bd_iso_ept_8 : 1;
    unsigned int en_high_bd_iso_ept_7 : 1;
    unsigned int en_high_bd_iso_ept_6 : 1;
    unsigned int en_high_bd_iso_ept_5 : 1;
    unsigned int en_high_bd_iso_ept_4 : 1;
    unsigned int en_high_bd_iso_ept_3 : 1;
    unsigned int en_high_bd_iso_ept_2 : 1;
    unsigned int en_high_bd_iso_ept_1 : 1;
    unsigned int data_bus_8_16   : 1;
    unsigned int byte_write_dpram : 1;
    unsigned int fifo_max_size   : 3;
    unsigned int dma_fifo_word_depth : 4;
    unsigned int dma_buffer_size : 1;
    unsigned int dma_channel_nbr : 3;
    unsigned int ept_nbr_max     : 4;
} avr32_usbb_ufeatures_t;



typedef struct avr32_usbb_usbfsm_t {
    unsigned int                 :28;
    unsigned int drdstate        : 4;
} avr32_usbb_usbfsm_t;



typedef struct avr32_usbb_t {
  union {
          unsigned long                  udcon     ;//0x0000
          avr32_usbb_udcon_t             UDCON     ;
  };
  union {
    const unsigned long                  udint     ;//0x0004
    const avr32_usbb_udint_t             UDINT     ;
  };
  union {
          unsigned long                  udintclr  ;//0x0008
          avr32_usbb_udintclr_t          UDINTCLR  ;
  };
  union {
          unsigned long                  udintset  ;//0x000c
          avr32_usbb_udintset_t          UDINTSET  ;
  };
  union {
    const unsigned long                  udinte    ;//0x0010
    const avr32_usbb_udinte_t            UDINTE    ;
  };
  union {
          unsigned long                  udinteclr ;//0x0014
          avr32_usbb_udinteclr_t         UDINTECLR ;
  };
  union {
          unsigned long                  udinteset ;//0x0018
          avr32_usbb_udinteset_t         UDINTESET ;
  };
  union {
          unsigned long                  uerst     ;//0x001c
          avr32_usbb_uerst_t             UERST     ;
  };
  union {
    const unsigned long                  udfnum    ;//0x0020
    const avr32_usbb_udfnum_t            UDFNUM    ;
  };
  union {
          unsigned long                  udtst1    ;//0x0024
          avr32_usbb_udtst1_t            UDTST1    ;
  };
  union {
          unsigned long                  udtst2    ;//0x0028
          avr32_usbb_udtst2_t            UDTST2    ;
  };
    const unsigned long                  udvers    ;//0x002c
  union {
    const unsigned long                  udfeatures;//0x0030
    const avr32_usbb_udfeatures_t        UDFEATURES;
  };
    const unsigned long                  udaddrsize;//0x0034
    const unsigned long                  udname1   ;//0x0038
    const unsigned long                  udname2   ;//0x003c
          unsigned int                   :32       ;//0x0040
          unsigned int                   :32       ;//0x0044
          unsigned int                   :32       ;//0x0048
          unsigned int                   :32       ;//0x004c
          unsigned int                   :32       ;//0x0050
          unsigned int                   :32       ;//0x0054
          unsigned int                   :32       ;//0x0058
          unsigned int                   :32       ;//0x005c
          unsigned int                   :32       ;//0x0060
          unsigned int                   :32       ;//0x0064
          unsigned int                   :32       ;//0x0068
          unsigned int                   :32       ;//0x006c
          unsigned int                   :32       ;//0x0070
          unsigned int                   :32       ;//0x0074
          unsigned int                   :32       ;//0x0078
          unsigned int                   :32       ;//0x007c
          unsigned int                   :32       ;//0x0080
          unsigned int                   :32       ;//0x0084
          unsigned int                   :32       ;//0x0088
          unsigned int                   :32       ;//0x008c
          unsigned int                   :32       ;//0x0090
          unsigned int                   :32       ;//0x0094
          unsigned int                   :32       ;//0x0098
          unsigned int                   :32       ;//0x009c
          unsigned int                   :32       ;//0x00a0
          unsigned int                   :32       ;//0x00a4
          unsigned int                   :32       ;//0x00a8
          unsigned int                   :32       ;//0x00ac
          unsigned int                   :32       ;//0x00b0
          unsigned int                   :32       ;//0x00b4
          unsigned int                   :32       ;//0x00b8
          unsigned int                   :32       ;//0x00bc
          unsigned int                   :32       ;//0x00c0
          unsigned int                   :32       ;//0x00c4
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
          unsigned int                   :32       ;//0x00fc
  union {
          unsigned long                  uecfg0    ;//0x0100
          avr32_usbb_uecfg0_t            UECFG0    ;
  };
  union {
          unsigned long                  uecfg1    ;//0x0104
          avr32_usbb_uecfg1_t            UECFG1    ;
  };
  union {
          unsigned long                  uecfg2    ;//0x0108
          avr32_usbb_uecfg2_t            UECFG2    ;
  };
  union {
          unsigned long                  uecfg3    ;//0x010c
          avr32_usbb_uecfg3_t            UECFG3    ;
  };
  union {
          unsigned long                  uecfg4    ;//0x0110
          avr32_usbb_uecfg4_t            UECFG4    ;
  };
  union {
          unsigned long                  uecfg5    ;//0x0114
          avr32_usbb_uecfg5_t            UECFG5    ;
  };
  union {
          unsigned long                  uecfg6    ;//0x0118
          avr32_usbb_uecfg6_t            UECFG6    ;
  };
          unsigned int                   :32       ;//0x011c
          unsigned int                   :32       ;//0x0120
          unsigned int                   :32       ;//0x0124
          unsigned int                   :32       ;//0x0128
          unsigned int                   :32       ;//0x012c
  union {
    const unsigned long                  uesta0    ;//0x0130
    const avr32_usbb_uesta0_t            UESTA0    ;
  };
  union {
    const unsigned long                  uesta1    ;//0x0134
    const avr32_usbb_uesta1_t            UESTA1    ;
  };
  union {
    const unsigned long                  uesta2    ;//0x0138
    const avr32_usbb_uesta2_t            UESTA2    ;
  };
  union {
    const unsigned long                  uesta3    ;//0x013c
    const avr32_usbb_uesta3_t            UESTA3    ;
  };
  union {
    const unsigned long                  uesta4    ;//0x0140
    const avr32_usbb_uesta4_t            UESTA4    ;
  };
  union {
    const unsigned long                  uesta5    ;//0x0144
    const avr32_usbb_uesta5_t            UESTA5    ;
  };
  union {
    const unsigned long                  uesta6    ;//0x0148
    const avr32_usbb_uesta6_t            UESTA6    ;
  };
          unsigned int                   :32       ;//0x014c
          unsigned int                   :32       ;//0x0150
          unsigned int                   :32       ;//0x0154
          unsigned int                   :32       ;//0x0158
          unsigned int                   :32       ;//0x015c
  union {
          unsigned long                  uesta0clr ;//0x0160
          avr32_usbb_uesta0clr_t         UESTA0CLR ;
  };
  union {
          unsigned long                  uesta1clr ;//0x0164
          avr32_usbb_uesta1clr_t         UESTA1CLR ;
  };
  union {
          unsigned long                  uesta2clr ;//0x0168
          avr32_usbb_uesta2clr_t         UESTA2CLR ;
  };
  union {
          unsigned long                  uesta3clr ;//0x016c
          avr32_usbb_uesta3clr_t         UESTA3CLR ;
  };
  union {
          unsigned long                  uesta4clr ;//0x0170
          avr32_usbb_uesta4clr_t         UESTA4CLR ;
  };
  union {
          unsigned long                  uesta5clr ;//0x0174
          avr32_usbb_uesta5clr_t         UESTA5CLR ;
  };
  union {
          unsigned long                  uesta6clr ;//0x0178
          avr32_usbb_uesta6clr_t         UESTA6CLR ;
  };
          unsigned int                   :32       ;//0x017c
          unsigned int                   :32       ;//0x0180
          unsigned int                   :32       ;//0x0184
          unsigned int                   :32       ;//0x0188
          unsigned int                   :32       ;//0x018c
  union {
          unsigned long                  uesta0set ;//0x0190
          avr32_usbb_uesta0set_t         UESTA0SET ;
  };
  union {
          unsigned long                  uesta1set ;//0x0194
          avr32_usbb_uesta1set_t         UESTA1SET ;
  };
  union {
          unsigned long                  uesta2set ;//0x0198
          avr32_usbb_uesta2set_t         UESTA2SET ;
  };
  union {
          unsigned long                  uesta3set ;//0x019c
          avr32_usbb_uesta3set_t         UESTA3SET ;
  };
  union {
          unsigned long                  uesta4set ;//0x01a0
          avr32_usbb_uesta4set_t         UESTA4SET ;
  };
  union {
          unsigned long                  uesta5set ;//0x01a4
          avr32_usbb_uesta5set_t         UESTA5SET ;
  };
  union {
          unsigned long                  uesta6set ;//0x01a8
          avr32_usbb_uesta6set_t         UESTA6SET ;
  };
          unsigned int                   :32       ;//0x01ac
          unsigned int                   :32       ;//0x01b0
          unsigned int                   :32       ;//0x01b4
          unsigned int                   :32       ;//0x01b8
          unsigned int                   :32       ;//0x01bc
  union {
    const unsigned long                  uecon0    ;//0x01c0
    const avr32_usbb_uecon0_t            UECON0    ;
  };
  union {
    const unsigned long                  uecon1    ;//0x01c4
    const avr32_usbb_uecon1_t            UECON1    ;
  };
  union {
    const unsigned long                  uecon2    ;//0x01c8
    const avr32_usbb_uecon2_t            UECON2    ;
  };
  union {
    const unsigned long                  uecon3    ;//0x01cc
    const avr32_usbb_uecon3_t            UECON3    ;
  };
  union {
    const unsigned long                  uecon4    ;//0x01d0
    const avr32_usbb_uecon4_t            UECON4    ;
  };
  union {
    const unsigned long                  uecon5    ;//0x01d4
    const avr32_usbb_uecon5_t            UECON5    ;
  };
  union {
    const unsigned long                  uecon6    ;//0x01d8
    const avr32_usbb_uecon6_t            UECON6    ;
  };
          unsigned int                   :32       ;//0x01dc
          unsigned int                   :32       ;//0x01e0
          unsigned int                   :32       ;//0x01e4
          unsigned int                   :32       ;//0x01e8
          unsigned int                   :32       ;//0x01ec
  union {
          unsigned long                  uecon0set ;//0x01f0
          avr32_usbb_uecon0set_t         UECON0SET ;
  };
  union {
          unsigned long                  uecon1set ;//0x01f4
          avr32_usbb_uecon1set_t         UECON1SET ;
  };
  union {
          unsigned long                  uecon2set ;//0x01f8
          avr32_usbb_uecon2set_t         UECON2SET ;
  };
  union {
          unsigned long                  uecon3set ;//0x01fc
          avr32_usbb_uecon3set_t         UECON3SET ;
  };
  union {
          unsigned long                  uecon4set ;//0x0200
          avr32_usbb_uecon4set_t         UECON4SET ;
  };
  union {
          unsigned long                  uecon5set ;//0x0204
          avr32_usbb_uecon5set_t         UECON5SET ;
  };
  union {
          unsigned long                  uecon6set ;//0x0208
          avr32_usbb_uecon6set_t         UECON6SET ;
  };
          unsigned int                   :32       ;//0x020c
          unsigned int                   :32       ;//0x0210
          unsigned int                   :32       ;//0x0214
          unsigned int                   :32       ;//0x0218
          unsigned int                   :32       ;//0x021c
  union {
          unsigned long                  uecon0clr ;//0x0220
          avr32_usbb_uecon0clr_t         UECON0CLR ;
  };
  union {
          unsigned long                  uecon1clr ;//0x0224
          avr32_usbb_uecon1clr_t         UECON1CLR ;
  };
  union {
          unsigned long                  uecon2clr ;//0x0228
          avr32_usbb_uecon2clr_t         UECON2CLR ;
  };
  union {
          unsigned long                  uecon3clr ;//0x022c
          avr32_usbb_uecon3clr_t         UECON3CLR ;
  };
  union {
          unsigned long                  uecon4clr ;//0x0230
          avr32_usbb_uecon4clr_t         UECON4CLR ;
  };
  union {
          unsigned long                  uecon5clr ;//0x0234
          avr32_usbb_uecon5clr_t         UECON5CLR ;
  };
  union {
          unsigned long                  uecon6clr ;//0x0238
          avr32_usbb_uecon6clr_t         UECON6CLR ;
  };
          unsigned int                   :32       ;//0x023c
          unsigned int                   :32       ;//0x0240
          unsigned int                   :32       ;//0x0244
          unsigned int                   :32       ;//0x0248
          unsigned int                   :32       ;//0x024c
          unsigned long                  uedat0    ;//0x0250
          unsigned long                  uedat1    ;//0x0254
          unsigned long                  uedat2    ;//0x0258
          unsigned long                  uedat3    ;//0x025c
          unsigned long                  uedat4    ;//0x0260
          unsigned long                  uedat5    ;//0x0264
          unsigned long                  uedat6    ;//0x0268
          unsigned int                   :32       ;//0x026c
          unsigned int                   :32       ;//0x0270
          unsigned int                   :32       ;//0x0274
          unsigned int                   :32       ;//0x0278
          unsigned int                   :32       ;//0x027c
          unsigned int                   :32       ;//0x0280
          unsigned int                   :32       ;//0x0284
          unsigned int                   :32       ;//0x0288
          unsigned int                   :32       ;//0x028c
          unsigned int                   :32       ;//0x0290
          unsigned int                   :32       ;//0x0294
          unsigned int                   :32       ;//0x0298
          unsigned int                   :32       ;//0x029c
          unsigned int                   :32       ;//0x02a0
          unsigned int                   :32       ;//0x02a4
          unsigned int                   :32       ;//0x02a8
          unsigned int                   :32       ;//0x02ac
          unsigned int                   :32       ;//0x02b0
          unsigned int                   :32       ;//0x02b4
          unsigned int                   :32       ;//0x02b8
          unsigned int                   :32       ;//0x02bc
          unsigned int                   :32       ;//0x02c0
          unsigned int                   :32       ;//0x02c4
          unsigned int                   :32       ;//0x02c8
          unsigned int                   :32       ;//0x02cc
          unsigned int                   :32       ;//0x02d0
          unsigned int                   :32       ;//0x02d4
          unsigned int                   :32       ;//0x02d8
          unsigned int                   :32       ;//0x02dc
          unsigned int                   :32       ;//0x02e0
          unsigned int                   :32       ;//0x02e4
          unsigned int                   :32       ;//0x02e8
          unsigned int                   :32       ;//0x02ec
          unsigned int                   :32       ;//0x02f0
          unsigned int                   :32       ;//0x02f4
          unsigned int                   :32       ;//0x02f8
          unsigned int                   :32       ;//0x02fc
          unsigned int                   :32       ;//0x0300
          unsigned int                   :32       ;//0x0304
          unsigned int                   :32       ;//0x0308
          unsigned int                   :32       ;//0x030c
  union {
          unsigned long                  uddma1_nextdesc;//0x0310
          avr32_usbb_uddma1_nextdesc_t   UDDMA1_NEXTDESC;
  };
          unsigned long                  uddma1_addr;//0x0314
  union {
          unsigned long                  uddma1_control;//0x0318
          avr32_usbb_uddma1_control_t    UDDMA1_CONTROL;
  };
  union {
          unsigned long                  uddma1_status;//0x031c
          avr32_usbb_uddma1_status_t     UDDMA1_STATUS;
  };
  union {
          unsigned long                  uddma2_nextdesc;//0x0320
          avr32_usbb_uddma2_nextdesc_t   UDDMA2_NEXTDESC;
  };
          unsigned long                  uddma2_addr;//0x0324
  union {
          unsigned long                  uddma2_control;//0x0328
          avr32_usbb_uddma2_control_t    UDDMA2_CONTROL;
  };
  union {
          unsigned long                  uddma2_status;//0x032c
          avr32_usbb_uddma2_status_t     UDDMA2_STATUS;
  };
  union {
          unsigned long                  uddma3_nextdesc;//0x0330
          avr32_usbb_uddma3_nextdesc_t   UDDMA3_NEXTDESC;
  };
          unsigned long                  uddma3_addr;//0x0334
  union {
          unsigned long                  uddma3_control;//0x0338
          avr32_usbb_uddma3_control_t    UDDMA3_CONTROL;
  };
  union {
          unsigned long                  uddma3_status;//0x033c
          avr32_usbb_uddma3_status_t     UDDMA3_STATUS;
  };
  union {
          unsigned long                  uddma4_nextdesc;//0x0340
          avr32_usbb_uddma4_nextdesc_t   UDDMA4_NEXTDESC;
  };
          unsigned long                  uddma4_addr;//0x0344
  union {
          unsigned long                  uddma4_control;//0x0348
          avr32_usbb_uddma4_control_t    UDDMA4_CONTROL;
  };
  union {
          unsigned long                  uddma4_status;//0x034c
          avr32_usbb_uddma4_status_t     UDDMA4_STATUS;
  };
  union {
          unsigned long                  uddma5_nextdesc;//0x0350
          avr32_usbb_uddma5_nextdesc_t   UDDMA5_NEXTDESC;
  };
          unsigned long                  uddma5_addr;//0x0354
  union {
          unsigned long                  uddma5_control;//0x0358
          avr32_usbb_uddma5_control_t    UDDMA5_CONTROL;
  };
  union {
          unsigned long                  uddma5_status;//0x035c
          avr32_usbb_uddma5_status_t     UDDMA5_STATUS;
  };
  union {
          unsigned long                  uddma6_nextdesc;//0x0360
          avr32_usbb_uddma6_nextdesc_t   UDDMA6_NEXTDESC;
  };
          unsigned long                  uddma6_addr;//0x0364
  union {
          unsigned long                  uddma6_control;//0x0368
          avr32_usbb_uddma6_control_t    UDDMA6_CONTROL;
  };
  union {
          unsigned long                  uddma6_status;//0x036c
          avr32_usbb_uddma6_status_t     UDDMA6_STATUS;
  };
          unsigned int                   :32       ;//0x0370
          unsigned int                   :32       ;//0x0374
          unsigned int                   :32       ;//0x0378
          unsigned int                   :32       ;//0x037c
          unsigned int                   :32       ;//0x0380
          unsigned int                   :32       ;//0x0384
          unsigned int                   :32       ;//0x0388
          unsigned int                   :32       ;//0x038c
          unsigned int                   :32       ;//0x0390
          unsigned int                   :32       ;//0x0394
          unsigned int                   :32       ;//0x0398
          unsigned int                   :32       ;//0x039c
          unsigned int                   :32       ;//0x03a0
          unsigned int                   :32       ;//0x03a4
          unsigned int                   :32       ;//0x03a8
          unsigned int                   :32       ;//0x03ac
          unsigned int                   :32       ;//0x03b0
          unsigned int                   :32       ;//0x03b4
          unsigned int                   :32       ;//0x03b8
          unsigned int                   :32       ;//0x03bc
          unsigned int                   :32       ;//0x03c0
          unsigned int                   :32       ;//0x03c4
          unsigned int                   :32       ;//0x03c8
          unsigned int                   :32       ;//0x03cc
          unsigned int                   :32       ;//0x03d0
          unsigned int                   :32       ;//0x03d4
          unsigned int                   :32       ;//0x03d8
          unsigned int                   :32       ;//0x03dc
          unsigned int                   :32       ;//0x03e0
          unsigned int                   :32       ;//0x03e4
          unsigned int                   :32       ;//0x03e8
          unsigned int                   :32       ;//0x03ec
          unsigned int                   :32       ;//0x03f0
          unsigned int                   :32       ;//0x03f4
          unsigned int                   :32       ;//0x03f8
          unsigned int                   :32       ;//0x03fc
  union {
          unsigned long                  uhcon     ;//0x0400
          avr32_usbb_uhcon_t             UHCON     ;
  };
  union {
    const unsigned long                  uhint     ;//0x0404
    const avr32_usbb_uhint_t             UHINT     ;
  };
  union {
          unsigned long                  uhintclr  ;//0x0408
          avr32_usbb_uhintclr_t          UHINTCLR  ;
  };
  union {
          unsigned long                  uhintset  ;//0x040c
          avr32_usbb_uhintset_t          UHINTSET  ;
  };
  union {
    const unsigned long                  uhinte    ;//0x0410
    const avr32_usbb_uhinte_t            UHINTE    ;
  };
  union {
          unsigned long                  uhinteclr ;//0x0414
          avr32_usbb_uhinteclr_t         UHINTECLR ;
  };
  union {
          unsigned long                  uhinteset ;//0x0418
          avr32_usbb_uhinteset_t         UHINTESET ;
  };
  union {
          unsigned long                  uprst     ;//0x041c
          avr32_usbb_uprst_t             UPRST     ;
  };
  union {
          unsigned long                  uhfnum    ;//0x0420
          avr32_usbb_uhfnum_t            UHFNUM    ;
  };
  union {
          unsigned long                  uhaddr1   ;//0x0424
          avr32_usbb_uhaddr1_t           UHADDR1   ;
  };
  union {
          unsigned long                  uhaddr2   ;//0x0428
          avr32_usbb_uhaddr2_t           UHADDR2   ;
  };
  union {
          unsigned long                  uhaddr3   ;//0x042c
          avr32_usbb_uhaddr3_t           UHADDR3   ;
  };
          unsigned int                   :32       ;//0x0430
          unsigned int                   :32       ;//0x0434
          unsigned int                   :32       ;//0x0438
          unsigned int                   :32       ;//0x043c
          unsigned int                   :32       ;//0x0440
          unsigned int                   :32       ;//0x0444
          unsigned int                   :32       ;//0x0448
          unsigned int                   :32       ;//0x044c
          unsigned int                   :32       ;//0x0450
          unsigned int                   :32       ;//0x0454
          unsigned int                   :32       ;//0x0458
          unsigned int                   :32       ;//0x045c
          unsigned int                   :32       ;//0x0460
          unsigned int                   :32       ;//0x0464
          unsigned int                   :32       ;//0x0468
          unsigned int                   :32       ;//0x046c
          unsigned int                   :32       ;//0x0470
          unsigned int                   :32       ;//0x0474
          unsigned int                   :32       ;//0x0478
          unsigned int                   :32       ;//0x047c
          unsigned int                   :32       ;//0x0480
          unsigned int                   :32       ;//0x0484
          unsigned int                   :32       ;//0x0488
          unsigned int                   :32       ;//0x048c
          unsigned int                   :32       ;//0x0490
          unsigned int                   :32       ;//0x0494
          unsigned int                   :32       ;//0x0498
          unsigned int                   :32       ;//0x049c
          unsigned int                   :32       ;//0x04a0
          unsigned int                   :32       ;//0x04a4
          unsigned int                   :32       ;//0x04a8
          unsigned int                   :32       ;//0x04ac
          unsigned int                   :32       ;//0x04b0
          unsigned int                   :32       ;//0x04b4
          unsigned int                   :32       ;//0x04b8
          unsigned int                   :32       ;//0x04bc
          unsigned int                   :32       ;//0x04c0
          unsigned int                   :32       ;//0x04c4
          unsigned int                   :32       ;//0x04c8
          unsigned int                   :32       ;//0x04cc
          unsigned int                   :32       ;//0x04d0
          unsigned int                   :32       ;//0x04d4
          unsigned int                   :32       ;//0x04d8
          unsigned int                   :32       ;//0x04dc
          unsigned int                   :32       ;//0x04e0
          unsigned int                   :32       ;//0x04e4
          unsigned int                   :32       ;//0x04e8
          unsigned int                   :32       ;//0x04ec
          unsigned int                   :32       ;//0x04f0
          unsigned int                   :32       ;//0x04f4
          unsigned int                   :32       ;//0x04f8
          unsigned int                   :32       ;//0x04fc
  union {
          unsigned long                  upcfg0    ;//0x0500
          avr32_usbb_upcfg0_t            UPCFG0    ;
  };
  union {
          unsigned long                  upcfg1    ;//0x0504
          avr32_usbb_upcfg1_t            UPCFG1    ;
  };
  union {
          unsigned long                  upcfg2    ;//0x0508
          avr32_usbb_upcfg2_t            UPCFG2    ;
  };
  union {
          unsigned long                  upcfg3    ;//0x050c
          avr32_usbb_upcfg3_t            UPCFG3    ;
  };
  union {
          unsigned long                  upcfg4    ;//0x0510
          avr32_usbb_upcfg4_t            UPCFG4    ;
  };
  union {
          unsigned long                  upcfg5    ;//0x0514
          avr32_usbb_upcfg5_t            UPCFG5    ;
  };
  union {
          unsigned long                  upcfg6    ;//0x0518
          avr32_usbb_upcfg6_t            UPCFG6    ;
  };
          unsigned int                   :32       ;//0x051c
          unsigned int                   :32       ;//0x0520
          unsigned int                   :32       ;//0x0524
          unsigned int                   :32       ;//0x0528
          unsigned int                   :32       ;//0x052c
  union {
    const unsigned long                  upsta0    ;//0x0530
    const avr32_usbb_upsta0_t            UPSTA0    ;
  };
  union {
    const unsigned long                  upsta1    ;//0x0534
    const avr32_usbb_upsta1_t            UPSTA1    ;
  };
  union {
    const unsigned long                  upsta2    ;//0x0538
    const avr32_usbb_upsta2_t            UPSTA2    ;
  };
  union {
    const unsigned long                  upsta3    ;//0x053c
    const avr32_usbb_upsta3_t            UPSTA3    ;
  };
  union {
    const unsigned long                  upsta4    ;//0x0540
    const avr32_usbb_upsta4_t            UPSTA4    ;
  };
  union {
    const unsigned long                  upsta5    ;//0x0544
    const avr32_usbb_upsta5_t            UPSTA5    ;
  };
  union {
    const unsigned long                  upsta6    ;//0x0548
    const avr32_usbb_upsta6_t            UPSTA6    ;
  };
          unsigned int                   :32       ;//0x054c
          unsigned int                   :32       ;//0x0550
          unsigned int                   :32       ;//0x0554
          unsigned int                   :32       ;//0x0558
          unsigned int                   :32       ;//0x055c
  union {
          unsigned long                  upsta0clr ;//0x0560
          avr32_usbb_upsta0clr_t         UPSTA0CLR ;
  };
  union {
          unsigned long                  upsta1clr ;//0x0564
          avr32_usbb_upsta1clr_t         UPSTA1CLR ;
  };
  union {
          unsigned long                  upsta2clr ;//0x0568
          avr32_usbb_upsta2clr_t         UPSTA2CLR ;
  };
  union {
          unsigned long                  upsta3clr ;//0x056c
          avr32_usbb_upsta3clr_t         UPSTA3CLR ;
  };
  union {
          unsigned long                  upsta4clr ;//0x0570
          avr32_usbb_upsta4clr_t         UPSTA4CLR ;
  };
  union {
          unsigned long                  upsta5clr ;//0x0574
          avr32_usbb_upsta5clr_t         UPSTA5CLR ;
  };
  union {
          unsigned long                  upsta6clr ;//0x0578
          avr32_usbb_upsta6clr_t         UPSTA6CLR ;
  };
          unsigned int                   :32       ;//0x057c
          unsigned int                   :32       ;//0x0580
          unsigned int                   :32       ;//0x0584
          unsigned int                   :32       ;//0x0588
          unsigned int                   :32       ;//0x058c
  union {
          unsigned long                  upsta0set ;//0x0590
          avr32_usbb_upsta0set_t         UPSTA0SET ;
  };
  union {
          unsigned long                  upsta1set ;//0x0594
          avr32_usbb_upsta1set_t         UPSTA1SET ;
  };
  union {
          unsigned long                  upsta2set ;//0x0598
          avr32_usbb_upsta2set_t         UPSTA2SET ;
  };
  union {
          unsigned long                  upsta3set ;//0x059c
          avr32_usbb_upsta3set_t         UPSTA3SET ;
  };
  union {
          unsigned long                  upsta4set ;//0x05a0
          avr32_usbb_upsta4set_t         UPSTA4SET ;
  };
  union {
          unsigned long                  upsta5set ;//0x05a4
          avr32_usbb_upsta5set_t         UPSTA5SET ;
  };
  union {
          unsigned long                  upsta6set ;//0x05a8
          avr32_usbb_upsta6set_t         UPSTA6SET ;
  };
          unsigned int                   :32       ;//0x05ac
          unsigned int                   :32       ;//0x05b0
          unsigned int                   :32       ;//0x05b4
          unsigned int                   :32       ;//0x05b8
          unsigned int                   :32       ;//0x05bc
  union {
    const unsigned long                  upcon0    ;//0x05c0
    const avr32_usbb_upcon0_t            UPCON0    ;
  };
  union {
    const unsigned long                  upcon1    ;//0x05c4
    const avr32_usbb_upcon1_t            UPCON1    ;
  };
  union {
    const unsigned long                  upcon2    ;//0x05c8
    const avr32_usbb_upcon2_t            UPCON2    ;
  };
  union {
    const unsigned long                  upcon3    ;//0x05cc
    const avr32_usbb_upcon3_t            UPCON3    ;
  };
  union {
    const unsigned long                  upcon4    ;//0x05d0
    const avr32_usbb_upcon4_t            UPCON4    ;
  };
  union {
    const unsigned long                  upcon5    ;//0x05d4
    const avr32_usbb_upcon5_t            UPCON5    ;
  };
  union {
    const unsigned long                  upcon6    ;//0x05d8
    const avr32_usbb_upcon6_t            UPCON6    ;
  };
          unsigned int                   :32       ;//0x05dc
          unsigned int                   :32       ;//0x05e0
          unsigned int                   :32       ;//0x05e4
          unsigned int                   :32       ;//0x05e8
          unsigned int                   :32       ;//0x05ec
  union {
          unsigned long                  upcon0set ;//0x05f0
          avr32_usbb_upcon0set_t         UPCON0SET ;
  };
  union {
          unsigned long                  upcon1set ;//0x05f4
          avr32_usbb_upcon1set_t         UPCON1SET ;
  };
  union {
          unsigned long                  upcon2set ;//0x05f8
          avr32_usbb_upcon2set_t         UPCON2SET ;
  };
  union {
          unsigned long                  upcon3set ;//0x05fc
          avr32_usbb_upcon3set_t         UPCON3SET ;
  };
  union {
          unsigned long                  upcon4set ;//0x0600
          avr32_usbb_upcon4set_t         UPCON4SET ;
  };
  union {
          unsigned long                  upcon5set ;//0x0604
          avr32_usbb_upcon5set_t         UPCON5SET ;
  };
  union {
          unsigned long                  upcon6set ;//0x0608
          avr32_usbb_upcon6set_t         UPCON6SET ;
  };
          unsigned int                   :32       ;//0x060c
          unsigned int                   :32       ;//0x0610
          unsigned int                   :32       ;//0x0614
          unsigned int                   :32       ;//0x0618
          unsigned int                   :32       ;//0x061c
  union {
          unsigned long                  upcon0clr ;//0x0620
          avr32_usbb_upcon0clr_t         UPCON0CLR ;
  };
  union {
          unsigned long                  upcon1clr ;//0x0624
          avr32_usbb_upcon1clr_t         UPCON1CLR ;
  };
  union {
          unsigned long                  upcon2clr ;//0x0628
          avr32_usbb_upcon2clr_t         UPCON2CLR ;
  };
  union {
          unsigned long                  upcon3clr ;//0x062c
          avr32_usbb_upcon3clr_t         UPCON3CLR ;
  };
  union {
          unsigned long                  upcon4clr ;//0x0630
          avr32_usbb_upcon4clr_t         UPCON4CLR ;
  };
  union {
          unsigned long                  upcon5clr ;//0x0634
          avr32_usbb_upcon5clr_t         UPCON5CLR ;
  };
  union {
          unsigned long                  upcon6clr ;//0x0638
          avr32_usbb_upcon6clr_t         UPCON6CLR ;
  };
          unsigned int                   :32       ;//0x063c
          unsigned int                   :32       ;//0x0640
          unsigned int                   :32       ;//0x0644
          unsigned int                   :32       ;//0x0648
          unsigned int                   :32       ;//0x064c
  union {
          unsigned long                  upinrq0   ;//0x0650
          avr32_usbb_upinrq0_t           UPINRQ0   ;
  };
  union {
          unsigned long                  upinrq1   ;//0x0654
          avr32_usbb_upinrq1_t           UPINRQ1   ;
  };
  union {
          unsigned long                  upinrq2   ;//0x0658
          avr32_usbb_upinrq2_t           UPINRQ2   ;
  };
  union {
          unsigned long                  upinrq3   ;//0x065c
          avr32_usbb_upinrq3_t           UPINRQ3   ;
  };
  union {
          unsigned long                  upinrq4   ;//0x0660
          avr32_usbb_upinrq4_t           UPINRQ4   ;
  };
  union {
          unsigned long                  upinrq5   ;//0x0664
          avr32_usbb_upinrq5_t           UPINRQ5   ;
  };
  union {
          unsigned long                  upinrq6   ;//0x0668
          avr32_usbb_upinrq6_t           UPINRQ6   ;
  };
          unsigned int                   :32       ;//0x066c
          unsigned int                   :32       ;//0x0670
          unsigned int                   :32       ;//0x0674
          unsigned int                   :32       ;//0x0678
          unsigned int                   :32       ;//0x067c
  union {
          unsigned long                  uperr0    ;//0x0680
          avr32_usbb_uperr0_t            UPERR0    ;
  };
  union {
          unsigned long                  uperr1    ;//0x0684
          avr32_usbb_uperr1_t            UPERR1    ;
  };
  union {
          unsigned long                  uperr2    ;//0x0688
          avr32_usbb_uperr2_t            UPERR2    ;
  };
  union {
          unsigned long                  uperr3    ;//0x068c
          avr32_usbb_uperr3_t            UPERR3    ;
  };
  union {
          unsigned long                  uperr4    ;//0x0690
          avr32_usbb_uperr4_t            UPERR4    ;
  };
  union {
          unsigned long                  uperr5    ;//0x0694
          avr32_usbb_uperr5_t            UPERR5    ;
  };
  union {
          unsigned long                  uperr6    ;//0x0698
          avr32_usbb_uperr6_t            UPERR6    ;
  };
          unsigned int                   :32       ;//0x069c
          unsigned int                   :32       ;//0x06a0
          unsigned int                   :32       ;//0x06a4
          unsigned int                   :32       ;//0x06a8
          unsigned int                   :32       ;//0x06ac
          unsigned long                  updat0    ;//0x06b0
          unsigned long                  updat1    ;//0x06b4
          unsigned long                  updat2    ;//0x06b8
          unsigned long                  updat3    ;//0x06bc
          unsigned long                  updat4    ;//0x06c0
          unsigned long                  updat5    ;//0x06c4
          unsigned long                  updat6    ;//0x06c8
          unsigned int                   :32       ;//0x06cc
          unsigned int                   :32       ;//0x06d0
          unsigned int                   :32       ;//0x06d4
          unsigned int                   :32       ;//0x06d8
          unsigned int                   :32       ;//0x06dc
          unsigned int                   :32       ;//0x06e0
          unsigned int                   :32       ;//0x06e4
          unsigned int                   :32       ;//0x06e8
          unsigned int                   :32       ;//0x06ec
          unsigned int                   :32       ;//0x06f0
          unsigned int                   :32       ;//0x06f4
          unsigned int                   :32       ;//0x06f8
          unsigned int                   :32       ;//0x06fc
          unsigned int                   :32       ;//0x0700
          unsigned int                   :32       ;//0x0704
          unsigned int                   :32       ;//0x0708
          unsigned int                   :32       ;//0x070c
  union {
          unsigned long                  uhdma1_nextdesc;//0x0710
          avr32_usbb_uhdma1_nextdesc_t   UHDMA1_NEXTDESC;
  };
          unsigned long                  uhdma1_addr;//0x0714
  union {
          unsigned long                  uhdma1_control;//0x0718
          avr32_usbb_uhdma1_control_t    UHDMA1_CONTROL;
  };
  union {
          unsigned long                  uhdma1_status;//0x071c
          avr32_usbb_uhdma1_status_t     UHDMA1_STATUS;
  };
  union {
          unsigned long                  uhdma2_nextdesc;//0x0720
          avr32_usbb_uhdma2_nextdesc_t   UHDMA2_NEXTDESC;
  };
          unsigned long                  uhdma2_addr;//0x0724
  union {
          unsigned long                  uhdma2_control;//0x0728
          avr32_usbb_uhdma2_control_t    UHDMA2_CONTROL;
  };
  union {
          unsigned long                  uhdma2_status;//0x072c
          avr32_usbb_uhdma2_status_t     UHDMA2_STATUS;
  };
  union {
          unsigned long                  uhdma3_nextdesc;//0x0730
          avr32_usbb_uhdma3_nextdesc_t   UHDMA3_NEXTDESC;
  };
          unsigned long                  uhdma3_addr;//0x0734
  union {
          unsigned long                  uhdma3_control;//0x0738
          avr32_usbb_uhdma3_control_t    UHDMA3_CONTROL;
  };
  union {
          unsigned long                  uhdma3_status;//0x073c
          avr32_usbb_uhdma3_status_t     UHDMA3_STATUS;
  };
  union {
          unsigned long                  uhdma4_nextdesc;//0x0740
          avr32_usbb_uhdma4_nextdesc_t   UHDMA4_NEXTDESC;
  };
          unsigned long                  uhdma4_addr;//0x0744
  union {
          unsigned long                  uhdma4_control;//0x0748
          avr32_usbb_uhdma4_control_t    UHDMA4_CONTROL;
  };
  union {
          unsigned long                  uhdma4_status;//0x074c
          avr32_usbb_uhdma4_status_t     UHDMA4_STATUS;
  };
  union {
          unsigned long                  uhdma5_nextdesc;//0x0750
          avr32_usbb_uhdma5_nextdesc_t   UHDMA5_NEXTDESC;
  };
          unsigned long                  uhdma5_addr;//0x0754
  union {
          unsigned long                  uhdma5_control;//0x0758
          avr32_usbb_uhdma5_control_t    UHDMA5_CONTROL;
  };
  union {
          unsigned long                  uhdma5_status;//0x075c
          avr32_usbb_uhdma5_status_t     UHDMA5_STATUS;
  };
  union {
          unsigned long                  uhdma6_nextdesc;//0x0760
          avr32_usbb_uhdma6_nextdesc_t   UHDMA6_NEXTDESC;
  };
          unsigned long                  uhdma6_addr;//0x0764
  union {
          unsigned long                  uhdma6_control;//0x0768
          avr32_usbb_uhdma6_control_t    UHDMA6_CONTROL;
  };
  union {
          unsigned long                  uhdma6_status;//0x076c
          avr32_usbb_uhdma6_status_t     UHDMA6_STATUS;
  };
          unsigned int                   :32       ;//0x0770
          unsigned int                   :32       ;//0x0774
          unsigned int                   :32       ;//0x0778
          unsigned int                   :32       ;//0x077c
          unsigned int                   :32       ;//0x0780
          unsigned int                   :32       ;//0x0784
          unsigned int                   :32       ;//0x0788
          unsigned int                   :32       ;//0x078c
          unsigned int                   :32       ;//0x0790
          unsigned int                   :32       ;//0x0794
          unsigned int                   :32       ;//0x0798
          unsigned int                   :32       ;//0x079c
          unsigned int                   :32       ;//0x07a0
          unsigned int                   :32       ;//0x07a4
          unsigned int                   :32       ;//0x07a8
          unsigned int                   :32       ;//0x07ac
          unsigned int                   :32       ;//0x07b0
          unsigned int                   :32       ;//0x07b4
          unsigned int                   :32       ;//0x07b8
          unsigned int                   :32       ;//0x07bc
          unsigned int                   :32       ;//0x07c0
          unsigned int                   :32       ;//0x07c4
          unsigned int                   :32       ;//0x07c8
          unsigned int                   :32       ;//0x07cc
          unsigned int                   :32       ;//0x07d0
          unsigned int                   :32       ;//0x07d4
          unsigned int                   :32       ;//0x07d8
          unsigned int                   :32       ;//0x07dc
          unsigned int                   :32       ;//0x07e0
          unsigned int                   :32       ;//0x07e4
          unsigned int                   :32       ;//0x07e8
          unsigned int                   :32       ;//0x07ec
          unsigned int                   :32       ;//0x07f0
          unsigned int                   :32       ;//0x07f4
          unsigned int                   :32       ;//0x07f8
          unsigned int                   :32       ;//0x07fc
  union {
          unsigned long                  usbcon    ;//0x0800
          avr32_usbb_usbcon_t            USBCON    ;
  };
  union {
    const unsigned long                  usbsta    ;//0x0804
    const avr32_usbb_usbsta_t            USBSTA    ;
  };
  union {
          unsigned long                  usbstaclr ;//0x0808
          avr32_usbb_usbstaclr_t         USBSTACLR ;
  };
  union {
          unsigned long                  usbstaset ;//0x080c
          avr32_usbb_usbstaset_t         USBSTASET ;
  };
  union {
          unsigned long                  uatst1    ;//0x0810
          avr32_usbb_uatst1_t            UATST1    ;
  };
  union {
          unsigned long                  uatst2    ;//0x0814
          avr32_usbb_uatst2_t            UATST2    ;
  };
  union {
    const unsigned long                  uvers     ;//0x0818
    const avr32_usbb_uvers_t             UVERS     ;
  };
  union {
    const unsigned long                  ufeatures ;//0x081c
    const avr32_usbb_ufeatures_t         UFEATURES ;
  };
    const unsigned long                  uaddrsize ;//0x0820
    const unsigned long                  uname1    ;//0x0824
    const unsigned long                  uname2    ;//0x0828
  union {
    const unsigned long                  usbfsm    ;//0x082c
    const avr32_usbb_usbfsm_t            USBFSM    ;
  };
} avr32_usbb_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif

/*#ifdef AVR32_USBB_310_H_INCLUDED*/
#endif

