/*****************************************************************************
 *
 * Copyright (C) 2008-2010 Atmel Corporation
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in
 *   the documentation and/or other materials provided with the
 *   distribution.
 *
 * * Neither the name of the copyright holders nor the names of
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN

#define AVR32_TC_TIMER_CLOCK5                             0x00000004
#define AVR32_TC_TIOA0                                    0x00000002
#define AVR32_TC_TIOA2                                    0x00000003
#define AVR32_TC_TIOB_INPUT                               0x00000000
#define AVR32_TC_TOGGLE                                   0x00000003
#define AVR32_TC_UPDOWN_AUTO                              0x00000003
#define AVR32_TC_UPDOWN_NO_AUTO                           0x00000001
#define AVR32_TC_UP_AUTO                                  0x00000002
#define AVR32_TC_UP_NO_AUTO                               0x00000000
#define AVR32_TC_WAVE                                             15
#define AVR32_TC_WAVE_MASK                                0x00008000
#define AVR32_TC_WAVE_OFFSET                                      15
#define AVR32_TC_WAVE_SIZE                                         1
#define AVR32_TC_WAVSEL                                           13
#define AVR32_TC_WAVSEL_MASK                              0x00006000
#define AVR32_TC_WAVSEL_OFFSET                                    13
#define AVR32_TC_WAVSEL_SIZE                                       2
#define AVR32_TC_WAVSEL_UPDOWN_AUTO                       0x00000003
#define AVR32_TC_WAVSEL_UPDOWN_NO_AUTO                    0x00000001
#define AVR32_TC_WAVSEL_UP_AUTO                           0x00000002
#define AVR32_TC_WAVSEL_UP_NO_AUTO                        0x00000000
#define AVR32_TC_XC0                                      0x00000005
#define AVR32_TC_XC0_OUTPUT                               0x00000001
#define AVR32_TC_XC1                                      0x00000006
#define AVR32_TC_XC1_OUTPUT                               0x00000002
#define AVR32_TC_XC2                                      0x00000007
#define AVR32_TC_XC2_OUTPUT                               0x00000003
#define AVR32_TC_VARIANT                                          16
#define AVR32_TC_VARIANT_MASK                             0x00070000
#define AVR32_TC_VARIANT_OFFSET                                   16
#define AVR32_TC_VARIANT_SIZE                                      3
#define AVR32_TC_VERSION                                  0x000000fc
#define AVR32_TC_VERSION_MASK                             0x00000fff
#define AVR32_TC_VERSION_OFFSET                                    0
#define AVR32_TC_VERSION_SIZE                                     12
#define AVR32_TC_VERSION_VARIANT                                  16
#define AVR32_TC_VERSION_VARIANT_MASK                     0x00070000
#define AVR32_TC_VERSION_VARIANT_OFFSET                           16
#define AVR32_TC_VERSION_VARIANT_SIZE                              3
#define AVR32_TC_VERSION_VERSION                                   0
#define AVR32_TC_VERSION_VERSION_MASK                     0x00000fff
#define AVR32_TC_VERSION_VERSION_OFFSET                            0
#define AVR32_TC_VERSION_VERSION_SIZE                             12




#ifdef __AVR32_ABI_COMPILER__


typedef struct avr32_tc_ccr_t {
    unsigned int                 :29;
    unsigned int swtrg           : 1;
    unsigned int clkdis          : 1;
    unsigned int clken           : 1;
} avr32_tc_ccr_t;



typedef union avr32_tc_cmr_t {
  struct {
    unsigned int                 :12;
    unsigned int ldrb            : 2;
    unsigned int ldra            : 2;
    unsigned int wave            : 1;
    unsigned int cpctrg          : 1;
    unsigned int                 : 3;
    unsigned int abetrg          : 1;
    unsigned int etrgedg         : 2;
    unsigned int ldbdis          : 1;
    unsigned int ldbstop         : 1;
    unsigned int burst           : 2;
    unsigned int clki            : 1;
    unsigned int tcclks          : 3;
  } capture;
  struct {
    unsigned int bswtrg          : 2;
    unsigned int beevt           : 2;
    unsigned int bcpc            : 2;
    unsigned int bcpb            : 2;
    unsigned int aswtrg          : 2;
    unsigned int aeevt           : 2;
    unsigned int acpc            : 2;
    unsigned int acpa            : 2;
    unsigned int wave            : 1;
    unsigned int wavsel          : 2;
    unsigned int enetrg          : 1;
    unsigned int eevt            : 2;
    unsigned int eevtedg         : 2;
    unsigned int cpcdis          : 1;
    unsigned int cpcstop         : 1;
    unsigned int burst           : 2;
    unsigned int clki            : 1;
    unsigned int tcclks          : 3;
  } waveform;
} avr32_tc_cmr_t;



typedef struct avr32_tc_cv_t {
    unsigned int                 :16;
    unsigned int cv              :16;
} avr32_tc_cv_t;



typedef struct avr32_tc_ra_t {
    unsigned int                 :16;
    unsigned int ra              :16;
} avr32_tc_ra_t;



typedef struct avr32_tc_rb_t {
    unsigned int                 :16;
    unsigned int rb              :16;
} avr32_tc_rb_t;



typedef struct avr32_tc_rc_t {
    unsigned int                 :16;
    unsigned int rc              :16;
} avr32_tc_rc_t;



typedef struct avr32_tc_sr_t {
    unsigned int                 :13;
    unsigned int mtiob           : 1;
    unsigned int mtioa           : 1;
    unsigned int clksta          : 1;
    unsigned int                 : 8;
    unsigned int etrgs           : 1;
    unsigned int ldrbs           : 1;
    unsigned int ldras           : 1;
    unsigned int cpcs            : 1;
    unsigned int cpbs            : 1;
    unsigned int cpas            : 1;
    unsigned int lovrs           : 1;
    unsigned int covfs           : 1;
} avr32_tc_sr_t;



typedef struct avr32_tc_ier_t {
    unsigned int                 :24;
    unsigned int etrgs           : 1;
    unsigned int ldrbs           : 1;
    unsigned int ldras           : 1;
    unsigned int cpcs            : 1;
    unsigned int cpbs            : 1;
    unsigned int cpas            : 1;
    unsigned int lovrs           : 1;
    unsigned int covfs           : 1;
} avr32_tc_ier_t;



typedef struct avr32_tc_idr_t {
    unsigned int                 :24;
    unsigned int etrgs           : 1;
    unsigned int ldrbs           : 1;
    unsigned int ldras           : 1;
    unsigned int cpcs            : 1;
    unsigned int cpbs            : 1;
    unsigned int cpas            : 1;
    unsigned int lovrs           : 1;
    unsigned int covfs           : 1;
} avr32_tc_idr_t;



typedef struct avr32_tc_imr_t {
    unsigned int                 :24;
    unsigned int etrgs           : 1;
    unsigned int ldrbs           : 1;
    unsigned int ldras           : 1;
    unsigned int cpcs            : 1;
    unsigned int cpbs            : 1;
    unsigned int cpas            : 1;
    unsigned int lovrs           : 1;
    unsigned int covfs           : 1;
} avr32_tc_imr_t;



typedef struct avr32_tc_bcr_t {
    unsigned int                 :31;
    unsigned int sync            : 1;
} avr32_tc_bcr_t;



typedef struct avr32_tc_bmr_t {
    unsigned int                 :26;
    unsigned int tc2xc2s         : 2;
    unsigned int tc1xc1s         : 2;
    unsigned int tc0xc0s         : 2;
} avr32_tc_bmr_t;



typedef struct avr32_tc_version_t {
    unsigned int                 :13;
    unsigned int variant         : 3;
    unsigned int                 : 4;
    unsigned int version         :12;
} avr32_tc_version_t;


typedef struct avr32_tc_channel_t {
  union {
          unsigned long                  ccr       ;//0x0000
          avr32_tc_ccr_t                 CCR       ;
  };
  union {
          unsigned long                  cmr       ;//0x0004
          avr32_tc_cmr_t                 CMR       ;
  };
          unsigned int                   :32       ;//0x0008
          unsigned int                   :32       ;//0x000c
  union {
    const unsigned long                  cv        ;//0x0010
    const avr32_tc_cv_t                  CV        ;
  };
  union {
          unsigned long                  ra        ;//0x0014
          avr32_tc_ra_t                  RA        ;
  };
  union {
          unsigned long                  rb        ;//0x0018
          avr32_tc_rb_t                  RB        ;
  };
  union {
          unsigned long                  rc        ;//0x001c
          avr32_tc_rc_t                  RC        ;
  };
  union {
    const unsigned long                  sr        ;//0x0020
    const avr32_tc_sr_t                  SR        ;
  };
  union {
          unsigned long                  ier       ;//0x0024
          avr32_tc_ier_t                 IER       ;
  };
  union {
          unsigned long                  idr       ;//0x0028
          avr32_tc_idr_t                 IDR       ;
  };
  union {
    const unsigned long                  imr       ;//0x002c
    const avr32_tc_imr_t                 IMR       ;
  };
          unsigned int                   :32       ;//0x0030
          unsigned int                   :32       ;//0x0034
          unsigned int                   :32       ;//0x0038
          unsigned int                   :32       ;//0x003c
} avr32_tc_channel_t;


typedef struct avr32_tc_t {
  avr32_tc_channel_t channel[3];//0x0
  union {
          unsigned long                  bcr       ;//0x00c0
          avr32_tc_bcr_t                 BCR       ;
  };
  union {
          unsigned long                  bmr       ;//0x00c4
          avr32_tc_bmr_t                 BMR       ;
  };
          unsigned int                   :32       ;//0x00c8
          unsigned int                   :32       ;//0x00cc
          unsigned int                   :32       ;//0x00d0
          unsigned int                   :32       ;//0x00d4
          unsigned int                   :32       ;//0x00d8
          unsigned int                   :32       ;//0x00dc
          unsigned int                   :32       ;//0x00e0
          unsigned int                   :32       ;//0x00e4
          unsigned int                   :32       ;//0x00e8
          unsigned int                   :32       ;//0x00ec
          unsigned int                   :32       ;//0x00f0
          unsigned int                   :32       ;//0x00f4
          unsigned int                   :32       ;//0x00f8
  union {
    const unsigned long                  version   ;//0x00fc
    const avr32_tc_version_t             VERSION   ;
  };
} avr32_tc_t;



/*#ifdef __AVR32_ABI_COMPILER__*/
#endif


#if !defined (DEPRECATED_DISABLE)

#define AVR32_TC_CMR0_TCCLKS_TIMER_DIV1_CLOCK             0x00000000
#define AVR32_TC_CMR0_TCCLKS_TIMER_DIV2_CLOCK             0x00000001
#define AVR32_TC_CMR0_TCCLKS_TIMER_DIV3_CLOCK             0x00000002
#define AVR32_TC_CMR0_TCCLKS_TIMER_DIV4_CLOCK             0x00000003
#define AVR32_TC_CMR0_TCCLKS_TIMER_DIV5_CLOCK             0x00000004

#define AVR32_TC_CMR1_TCCLKS_TIMER_DIV1_CLOCK             0x00000000
#define AVR32_TC_CMR1_TCCLKS_TIMER_DIV2_CLOCK             0x00000001
#define AVR32_TC_CMR1_TCCLKS_TIMER_DIV3_CLOCK             0x00000002
#define AVR32_TC_CMR1_TCCLKS_TIMER_DIV4_CLOCK             0x00000003
#define AVR32_TC_CMR1_TCCLKS_TIMER_DIV5_CLOCK             0x00000004

#define AVR32_TC_CMR2_TCCLKS_TIMER_DIV1_CLOCK             0x00000000
